module {
  func.func @main(%arg0: tensor<65536x768xf32>, %arg1: tensor<768x768xf32>, %arg2: tensor<768x768xf32>, %arg3: tensor<768x768xf32>, %arg4: tensor<768x768xf32>, %arg5: tensor<3072x768xf32>, %arg6: tensor<768x3072xf32>, %arg7: tensor<768x768xf32>, %arg8: tensor<768x768xf32>, %arg9: tensor<768x768xf32>, %arg10: tensor<768x768xf32>, %arg11: tensor<3072x768xf32>, %arg12: tensor<768x3072xf32>, %arg13: tensor<768x768xf32>, %arg14: tensor<768x768xf32>, %arg15: tensor<768x768xf32>, %arg16: tensor<768x768xf32>, %arg17: tensor<3072x768xf32>, %arg18: tensor<768x3072xf32>, %arg19: tensor<768x768xf32>, %arg20: tensor<768x768xf32>, %arg21: tensor<768x768xf32>, %arg22: tensor<768x768xf32>, %arg23: tensor<3072x768xf32>, %arg24: tensor<768x3072xf32>, %arg25: tensor<768x768xf32>, %arg26: tensor<768x768xf32>, %arg27: tensor<768x768xf32>, %arg28: tensor<768x768xf32>, %arg29: tensor<3072x768xf32>, %arg30: tensor<768x3072xf32>, %arg31: tensor<768x768xf32>, %arg32: tensor<768x768xf32>, %arg33: tensor<768x768xf32>, %arg34: tensor<768x768xf32>, %arg35: tensor<3072x768xf32>, %arg36: tensor<768x3072xf32>, %arg37: tensor<768x768xf32>, %arg38: tensor<768x768xf32>, %arg39: tensor<768x768xf32>, %arg40: tensor<768x768xf32>, %arg41: tensor<3072x768xf32>, %arg42: tensor<768x3072xf32>, %arg43: tensor<768x768xf32>, %arg44: tensor<768x768xf32>, %arg45: tensor<768x768xf32>, %arg46: tensor<768x768xf32>, %arg47: tensor<3072x768xf32>, %arg48: tensor<768x3072xf32>, %arg49: tensor<768x768xf32>, %arg50: tensor<768x768xf32>, %arg51: tensor<768x768xf32>, %arg52: tensor<768x768xf32>, %arg53: tensor<3072x768xf32>, %arg54: tensor<768x3072xf32>, %arg55: tensor<768x768xf32>, %arg56: tensor<768x768xf32>, %arg57: tensor<768x768xf32>, %arg58: tensor<768x768xf32>, %arg59: tensor<3072x768xf32>, %arg60: tensor<768x3072xf32>, %arg61: tensor<768x768xf32>, %arg62: tensor<768x768xf32>, %arg63: tensor<768x768xf32>, %arg64: tensor<768x768xf32>, %arg65: tensor<3072x768xf32>, %arg66: tensor<768x3072xf32>, %arg67: tensor<768x768xf32>, %arg68: tensor<768x768xf32>, %arg69: tensor<768x768xf32>, %arg70: tensor<768x768xf32>, %arg71: tensor<3072x768xf32>, %arg72: tensor<768x3072xf32>, %arg73: tensor<65536x768xf32>, %arg74: tensor<6x2048xi64>, %arg75: tensor<6x2048xi64>) -> tensor<f32> {
    %c = stablehlo.constant dense<0> : tensor<12288xi64>
    %c_0 = stablehlo.constant dense<-1> : tensor<12288xi64>
    %c_1 = stablehlo.constant dense<1> : tensor<2048x2048xi64>
    %c_2 = stablehlo.constant dense<0> : tensor<2048xi64>
    %c_3 = stablehlo.constant dense<1> : tensor<2048xi64>
    %c_4 = stablehlo.constant dense<2048> : tensor<i64>
    %c_5 = stablehlo.constant dense<1> : tensor<i64>
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %c_6 = stablehlo.constant dense<0> : tensor<i64>
    %cst_7 = stablehlo.constant dense<0xFF800000> : tensor<f32>
    %c_8 = stablehlo.constant dense<true> : tensor<2048x2048xi1>
    %cst_9 = stablehlo.constant dense_resource<torch_tensor_1_2048_1_64_torch.bfloat16_1> : tensor<1x2048x1x64xbf16>
    %cst_10 = stablehlo.constant dense_resource<torch_tensor_1_2048_1_64_torch.bfloat16> : tensor<1x2048x1x64xbf16>
    %cst_11 = stablehlo.constant dense<0.000000e+00> : tensor<6x2048x3072xf32>
    %cst_12 = arith.constant dense<2> : tensor<1xi64>
    %cst_13 = arith.constant dense<768> : tensor<1xi64>
    %cst_14 = arith.constant dense<1.000000e-05> : tensor<1xf64>
    %cst_15 = arith.constant dense<128> : tensor<1xi64>
    %cst_16 = arith.constant dense<0.088388347648318433> : tensor<1xf64>
    %cst_17 = arith.constant dense<15> : tensor<1xi64>
    %0 = "stablehlo.gather"(%arg0, %arg74) <{dimension_numbers = #stablehlo.gather<offset_dims = [2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 2>, indices_are_sorted = false, slice_sizes = array<i64: 1, 768>}> : (tensor<65536x768xf32>, tensor<6x2048xi64>) -> tensor<6x2048x768xf32>
    %1 = stablehlo.convert %0 : tensor<6x2048x768xf32>
    %2 = stablehlo.convert %cst_12 : (tensor<1xi64>) -> tensor<1xf32>
    %3 = stablehlo.reshape %2 : (tensor<1xf32>) -> tensor<f32>
    %4 = stablehlo.broadcast_in_dim %3, dims = [] : (tensor<f32>) -> tensor<6x2048x768xf32>
    %5 = stablehlo.power %1, %4 : tensor<6x2048x768xf32>
    %6 = stablehlo.reduce(%5 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<6x2048x768xf32>, tensor<f32>) -> tensor<6x2048xf32>
    %7 = stablehlo.reshape %6 : (tensor<6x2048xf32>) -> tensor<6x2048x1xf32>
    %8 = stablehlo.convert %cst_13 : (tensor<1xi64>) -> tensor<1xf32>
    %9 = stablehlo.reshape %8 : (tensor<1xf32>) -> tensor<f32>
    %10 = stablehlo.broadcast_in_dim %9, dims = [] : (tensor<f32>) -> tensor<6x2048x1xf32>
    %11 = stablehlo.divide %7, %10 : tensor<6x2048x1xf32>
    %12 = stablehlo.convert %cst_14 : (tensor<1xf64>) -> tensor<1xf32>
    %13 = stablehlo.reshape %12 : (tensor<1xf32>) -> tensor<f32>
    %14 = stablehlo.broadcast_in_dim %13, dims = [] : (tensor<f32>) -> tensor<6x2048x1xf32>
    %15 = stablehlo.add %11, %14 : tensor<6x2048x1xf32>
    %16 = stablehlo.rsqrt %15 : tensor<6x2048x1xf32>
    %17 = stablehlo.broadcast_in_dim %16, dims = [0, 1, 2] : (tensor<6x2048x1xf32>) -> tensor<6x2048x768xf32>
    %18 = stablehlo.multiply %1, %17 : tensor<6x2048x768xf32>
    %19 = stablehlo.power %18, %4 : tensor<6x2048x768xf32>
    %20 = stablehlo.reduce(%19 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<6x2048x768xf32>, tensor<f32>) -> tensor<6x2048xf32>
    %21 = stablehlo.reshape %20 : (tensor<6x2048xf32>) -> tensor<6x2048x1xf32>
    %22 = stablehlo.divide %21, %10 : tensor<6x2048x1xf32>
    %23 = stablehlo.add %22, %14 : tensor<6x2048x1xf32>
    %24 = stablehlo.rsqrt %23 : tensor<6x2048x1xf32>
    %25 = stablehlo.broadcast_in_dim %24, dims = [0, 1, 2] : (tensor<6x2048x1xf32>) -> tensor<6x2048x768xf32>
    %26 = stablehlo.multiply %18, %25 : tensor<6x2048x768xf32>
    %27 = stablehlo.transpose %arg1, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %28 = stablehlo.reshape %26 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %29 = stablehlo.dot_general %28, %27, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %30 = stablehlo.reshape %29 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %31 = stablehlo.reshape %30 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %32 = stablehlo.transpose %arg2, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %33 = stablehlo.dot_general %28, %32, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %34 = stablehlo.reshape %33 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %35 = stablehlo.reshape %34 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %36 = stablehlo.transpose %arg3, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %37 = stablehlo.dot_general %28, %36, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %38 = stablehlo.reshape %37 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %39 = stablehlo.reshape %38 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %40 = stablehlo.slice %31 [0:6, 0:2048, 0:6, 0:64] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %41 = stablehlo.slice %31 [0:6, 0:2048, 0:6, 64:128] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %42 = stablehlo.convert %cst_10 : (tensor<1x2048x1x64xbf16>) -> tensor<1x2048x1x64xf32>
    %43 = stablehlo.broadcast_in_dim %42, dims = [0, 1, 2, 3] : (tensor<1x2048x1x64xf32>) -> tensor<6x2048x6x64xf32>
    %44 = stablehlo.multiply %40, %43 : tensor<6x2048x6x64xf32>
    %45 = stablehlo.convert %cst_9 : (tensor<1x2048x1x64xbf16>) -> tensor<1x2048x1x64xf32>
    %46 = stablehlo.broadcast_in_dim %45, dims = [0, 1, 2, 3] : (tensor<1x2048x1x64xf32>) -> tensor<6x2048x6x64xf32>
    %47 = stablehlo.multiply %41, %46 : tensor<6x2048x6x64xf32>
    %48 = stablehlo.add %44, %47 : tensor<6x2048x6x64xf32>
    %49 = stablehlo.negate %cst_9 : tensor<1x2048x1x64xbf16>
    %50 = stablehlo.convert %49 : (tensor<1x2048x1x64xbf16>) -> tensor<1x2048x1x64xf32>
    %51 = stablehlo.broadcast_in_dim %50, dims = [0, 1, 2, 3] : (tensor<1x2048x1x64xf32>) -> tensor<6x2048x6x64xf32>
    %52 = stablehlo.multiply %40, %51 : tensor<6x2048x6x64xf32>
    %53 = stablehlo.multiply %41, %43 : tensor<6x2048x6x64xf32>
    %54 = stablehlo.add %52, %53 : tensor<6x2048x6x64xf32>
    %55 = stablehlo.concatenate %48, %54, dim = 3 : (tensor<6x2048x6x64xf32>, tensor<6x2048x6x64xf32>) -> tensor<6x2048x6x128xf32>
    %56 = stablehlo.slice %35 [0:6, 0:2048, 0:6, 0:64] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %57 = stablehlo.slice %35 [0:6, 0:2048, 0:6, 64:128] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %58 = stablehlo.multiply %56, %43 : tensor<6x2048x6x64xf32>
    %59 = stablehlo.multiply %57, %46 : tensor<6x2048x6x64xf32>
    %60 = stablehlo.add %58, %59 : tensor<6x2048x6x64xf32>
    %61 = stablehlo.multiply %56, %51 : tensor<6x2048x6x64xf32>
    %62 = stablehlo.multiply %57, %43 : tensor<6x2048x6x64xf32>
    %63 = stablehlo.add %61, %62 : tensor<6x2048x6x64xf32>
    %64 = stablehlo.concatenate %60, %63, dim = 3 : (tensor<6x2048x6x64xf32>, tensor<6x2048x6x64xf32>) -> tensor<6x2048x6x128xf32>
    %65 = stablehlo.broadcast_in_dim %3, dims = [] : (tensor<f32>) -> tensor<6x2048x6x128xf32>
    %66 = stablehlo.power %55, %65 : tensor<6x2048x6x128xf32>
    %67 = stablehlo.reduce(%66 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x2048x6x128xf32>, tensor<f32>) -> tensor<6x2048x6xf32>
    %68 = stablehlo.reshape %67 : (tensor<6x2048x6xf32>) -> tensor<6x2048x6x1xf32>
    %69 = stablehlo.convert %cst_15 : (tensor<1xi64>) -> tensor<1xf32>
    %70 = stablehlo.reshape %69 : (tensor<1xf32>) -> tensor<f32>
    %71 = stablehlo.broadcast_in_dim %70, dims = [] : (tensor<f32>) -> tensor<6x2048x6x1xf32>
    %72 = stablehlo.divide %68, %71 : tensor<6x2048x6x1xf32>
    %73 = stablehlo.broadcast_in_dim %13, dims = [] : (tensor<f32>) -> tensor<6x2048x6x1xf32>
    %74 = stablehlo.add %72, %73 : tensor<6x2048x6x1xf32>
    %75 = stablehlo.rsqrt %74 : tensor<6x2048x6x1xf32>
    %76 = stablehlo.broadcast_in_dim %75, dims = [0, 1, 2, 3] : (tensor<6x2048x6x1xf32>) -> tensor<6x2048x6x128xf32>
    %77 = stablehlo.multiply %55, %76 : tensor<6x2048x6x128xf32>
    %78 = stablehlo.power %64, %65 : tensor<6x2048x6x128xf32>
    %79 = stablehlo.reduce(%78 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x2048x6x128xf32>, tensor<f32>) -> tensor<6x2048x6xf32>
    %80 = stablehlo.reshape %79 : (tensor<6x2048x6xf32>) -> tensor<6x2048x6x1xf32>
    %81 = stablehlo.divide %80, %71 : tensor<6x2048x6x1xf32>
    %82 = stablehlo.add %81, %73 : tensor<6x2048x6x1xf32>
    %83 = stablehlo.rsqrt %82 : tensor<6x2048x6x1xf32>
    %84 = stablehlo.broadcast_in_dim %83, dims = [0, 1, 2, 3] : (tensor<6x2048x6x1xf32>) -> tensor<6x2048x6x128xf32>
    %85 = stablehlo.multiply %64, %84 : tensor<6x2048x6x128xf32>
    %86 = stablehlo.transpose %77, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %87 = stablehlo.transpose %85, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %88 = stablehlo.transpose %39, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %89 = stablehlo.transpose %87, dims = [0, 1, 3, 2] : (tensor<6x6x2048x128xf32>) -> tensor<6x6x128x2048xf32>
    %90 = stablehlo.reshape %86 : (tensor<6x6x2048x128xf32>) -> tensor<36x2048x128xf32>
    %91 = stablehlo.reshape %89 : (tensor<6x6x128x2048xf32>) -> tensor<36x128x2048xf32>
    %92 = stablehlo.broadcast_in_dim %91, dims = [0, 1, 2] : (tensor<36x128x2048xf32>) -> tensor<36x128x2048xf32>
    %93 = stablehlo.dot_general %90, %92, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<36x2048x128xf32>, tensor<36x128x2048xf32>) -> tensor<36x2048x2048xf32>
    %94 = stablehlo.reshape %93 : (tensor<36x2048x2048xf32>) -> tensor<6x6x2048x2048xf32>
    %95 = stablehlo.convert %cst_16 : (tensor<1xf64>) -> tensor<1xf32>
    %96 = stablehlo.reshape %95 : (tensor<1xf32>) -> tensor<f32>
    %97 = stablehlo.broadcast_in_dim %96, dims = [] : (tensor<f32>) -> tensor<6x6x2048x2048xf32>
    %98 = stablehlo.multiply %94, %97 : tensor<6x6x2048x2048xf32>
    %99 = stablehlo.convert %c_5 : (tensor<i64>) -> tensor<f64>
    %100 = stablehlo.convert %c_4 : (tensor<i64>) -> tensor<f64>
    %101 = stablehlo.divide %100, %99 : tensor<f64>
    %102 = stablehlo.ceil %101 : tensor<f64>
    %103 = stablehlo.convert %102 : (tensor<f64>) -> tensor<i64>
    %104 = stablehlo.reshape %103 : (tensor<i64>) -> tensor<1xi64>
    %105 = stablehlo.dynamic_iota %104, dim = 0 : (tensor<1xi64>) -> tensor<2048xi64>
    %106 = stablehlo.multiply %105, %c_3 : tensor<2048xi64>
    %107 = stablehlo.add %106, %c_2 : tensor<2048xi64>
    %108 = stablehlo.reshape %107 : (tensor<2048xi64>) -> tensor<1x2048xi64>
    %109 = stablehlo.reshape %107 : (tensor<2048xi64>) -> tensor<2048x1xi64>
    %110 = stablehlo.broadcast_in_dim %108, dims = [0, 1] : (tensor<1x2048xi64>) -> tensor<2048x2048xi64>
    %111 = stablehlo.broadcast_in_dim %109, dims = [0, 1] : (tensor<2048x1xi64>) -> tensor<2048x2048xi64>
    %112 = stablehlo.subtract %110, %111 : tensor<2048x2048xi64>
    %113 = stablehlo.compare  GE, %112, %c_1,  SIGNED : (tensor<2048x2048xi64>, tensor<2048x2048xi64>) -> tensor<2048x2048xi1>
    %114 = stablehlo.and %113, %c_8 : tensor<2048x2048xi1>
    %115 = stablehlo.reshape %114 : (tensor<2048x2048xi1>) -> tensor<1x1x2048x2048xi1>
    %116 = stablehlo.broadcast_in_dim %115, dims = [0, 1, 2, 3] : (tensor<1x1x2048x2048xi1>) -> tensor<6x6x2048x2048xi1>
    %117 = stablehlo.broadcast_in_dim %cst_7, dims = [] : (tensor<f32>) -> tensor<6x6x2048x2048xf32>
    %118 = stablehlo.broadcast_in_dim %98, dims = [0, 1, 2, 3] : (tensor<6x6x2048x2048xf32>) -> tensor<6x6x2048x2048xf32>
    %119 = stablehlo.select %116, %117, %118 : tensor<6x6x2048x2048xi1>, tensor<6x6x2048x2048xf32>
    %120 = stablehlo.reduce(%119 init: %cst_7) applies stablehlo.maximum across dimensions = [3] : (tensor<6x6x2048x2048xf32>, tensor<f32>) -> tensor<6x6x2048xf32>
    %121 = stablehlo.reshape %120 : (tensor<6x6x2048xf32>) -> tensor<6x6x2048x1xf32>
    %122 = stablehlo.broadcast_in_dim %121, dims = [0, 1, 2, 3] : (tensor<6x6x2048x1xf32>) -> tensor<6x6x2048x2048xf32>
    %123 = stablehlo.subtract %119, %122 : tensor<6x6x2048x2048xf32>
    %124 = stablehlo.exponential %123 : tensor<6x6x2048x2048xf32>
    %125 = stablehlo.reduce(%124 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x6x2048x2048xf32>, tensor<f32>) -> tensor<6x6x2048xf32>
    %126 = stablehlo.reshape %125 : (tensor<6x6x2048xf32>) -> tensor<6x6x2048x1xf32>
    %127 = stablehlo.broadcast_in_dim %126, dims = [0, 1, 2, 3] : (tensor<6x6x2048x1xf32>) -> tensor<6x6x2048x2048xf32>
    %128 = stablehlo.divide %124, %127 : tensor<6x6x2048x2048xf32>
    %129 = stablehlo.reshape %128 : (tensor<6x6x2048x2048xf32>) -> tensor<36x2048x2048xf32>
    %130 = stablehlo.reshape %88 : (tensor<6x6x2048x128xf32>) -> tensor<36x2048x128xf32>
    %131 = stablehlo.broadcast_in_dim %130, dims = [0, 1, 2] : (tensor<36x2048x128xf32>) -> tensor<36x2048x128xf32>
    %132 = stablehlo.dot_general %129, %131, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<36x2048x2048xf32>, tensor<36x2048x128xf32>) -> tensor<36x2048x128xf32>
    %133 = stablehlo.reshape %132 : (tensor<36x2048x128xf32>) -> tensor<6x6x2048x128xf32>
    %134 = stablehlo.transpose %133, dims = [0, 2, 1, 3] : (tensor<6x6x2048x128xf32>) -> tensor<6x2048x6x128xf32>
    %135 = stablehlo.reshape %134 : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x768xf32>
    %136 = stablehlo.transpose %arg4, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %137 = stablehlo.reshape %135 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %138 = stablehlo.dot_general %137, %136, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %139 = stablehlo.reshape %138 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %140 = stablehlo.add %18, %139 : tensor<6x2048x768xf32>
    %141 = stablehlo.power %140, %4 : tensor<6x2048x768xf32>
    %142 = stablehlo.reduce(%141 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<6x2048x768xf32>, tensor<f32>) -> tensor<6x2048xf32>
    %143 = stablehlo.reshape %142 : (tensor<6x2048xf32>) -> tensor<6x2048x1xf32>
    %144 = stablehlo.divide %143, %10 : tensor<6x2048x1xf32>
    %145 = stablehlo.add %144, %14 : tensor<6x2048x1xf32>
    %146 = stablehlo.rsqrt %145 : tensor<6x2048x1xf32>
    %147 = stablehlo.broadcast_in_dim %146, dims = [0, 1, 2] : (tensor<6x2048x1xf32>) -> tensor<6x2048x768xf32>
    %148 = stablehlo.multiply %140, %147 : tensor<6x2048x768xf32>
    %149 = stablehlo.transpose %arg5, dims = [1, 0] : (tensor<3072x768xf32>) -> tensor<768x3072xf32>
    %150 = stablehlo.reshape %148 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %151 = stablehlo.dot_general %150, %149, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x3072xf32>) -> tensor<12288x3072xf32>
    %152 = stablehlo.reshape %151 : (tensor<12288x3072xf32>) -> tensor<6x2048x3072xf32>
    %153 = stablehlo.maximum %152, %cst_11 : tensor<6x2048x3072xf32>
    %154 = stablehlo.broadcast_in_dim %3, dims = [] : (tensor<f32>) -> tensor<6x2048x3072xf32>
    %155 = stablehlo.power %153, %154 : tensor<6x2048x3072xf32>
    %156 = stablehlo.transpose %arg6, dims = [1, 0] : (tensor<768x3072xf32>) -> tensor<3072x768xf32>
    %157 = stablehlo.reshape %155 : (tensor<6x2048x3072xf32>) -> tensor<12288x3072xf32>
    %158 = stablehlo.dot_general %157, %156, contracting_dims = [1] x [0] : (tensor<12288x3072xf32>, tensor<3072x768xf32>) -> tensor<12288x768xf32>
    %159 = stablehlo.reshape %158 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %160 = stablehlo.add %140, %159 : tensor<6x2048x768xf32>
    %161 = stablehlo.power %160, %4 : tensor<6x2048x768xf32>
    %162 = stablehlo.reduce(%161 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<6x2048x768xf32>, tensor<f32>) -> tensor<6x2048xf32>
    %163 = stablehlo.reshape %162 : (tensor<6x2048xf32>) -> tensor<6x2048x1xf32>
    %164 = stablehlo.divide %163, %10 : tensor<6x2048x1xf32>
    %165 = stablehlo.add %164, %14 : tensor<6x2048x1xf32>
    %166 = stablehlo.rsqrt %165 : tensor<6x2048x1xf32>
    %167 = stablehlo.broadcast_in_dim %166, dims = [0, 1, 2] : (tensor<6x2048x1xf32>) -> tensor<6x2048x768xf32>
    %168 = stablehlo.multiply %160, %167 : tensor<6x2048x768xf32>
    %169 = stablehlo.transpose %arg7, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %170 = stablehlo.reshape %168 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %171 = stablehlo.dot_general %170, %169, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %172 = stablehlo.reshape %171 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %173 = stablehlo.reshape %172 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %174 = stablehlo.transpose %arg8, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %175 = stablehlo.dot_general %170, %174, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %176 = stablehlo.reshape %175 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %177 = stablehlo.reshape %176 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %178 = stablehlo.transpose %arg9, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %179 = stablehlo.dot_general %170, %178, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %180 = stablehlo.reshape %179 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %181 = stablehlo.reshape %180 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %182 = stablehlo.slice %173 [0:6, 0:2048, 0:6, 0:64] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %183 = stablehlo.slice %173 [0:6, 0:2048, 0:6, 64:128] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %184 = stablehlo.multiply %182, %43 : tensor<6x2048x6x64xf32>
    %185 = stablehlo.multiply %183, %46 : tensor<6x2048x6x64xf32>
    %186 = stablehlo.add %184, %185 : tensor<6x2048x6x64xf32>
    %187 = stablehlo.multiply %182, %51 : tensor<6x2048x6x64xf32>
    %188 = stablehlo.multiply %183, %43 : tensor<6x2048x6x64xf32>
    %189 = stablehlo.add %187, %188 : tensor<6x2048x6x64xf32>
    %190 = stablehlo.concatenate %186, %189, dim = 3 : (tensor<6x2048x6x64xf32>, tensor<6x2048x6x64xf32>) -> tensor<6x2048x6x128xf32>
    %191 = stablehlo.slice %177 [0:6, 0:2048, 0:6, 0:64] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %192 = stablehlo.slice %177 [0:6, 0:2048, 0:6, 64:128] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %193 = stablehlo.multiply %191, %43 : tensor<6x2048x6x64xf32>
    %194 = stablehlo.multiply %192, %46 : tensor<6x2048x6x64xf32>
    %195 = stablehlo.add %193, %194 : tensor<6x2048x6x64xf32>
    %196 = stablehlo.multiply %191, %51 : tensor<6x2048x6x64xf32>
    %197 = stablehlo.multiply %192, %43 : tensor<6x2048x6x64xf32>
    %198 = stablehlo.add %196, %197 : tensor<6x2048x6x64xf32>
    %199 = stablehlo.concatenate %195, %198, dim = 3 : (tensor<6x2048x6x64xf32>, tensor<6x2048x6x64xf32>) -> tensor<6x2048x6x128xf32>
    %200 = stablehlo.power %190, %65 : tensor<6x2048x6x128xf32>
    %201 = stablehlo.reduce(%200 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x2048x6x128xf32>, tensor<f32>) -> tensor<6x2048x6xf32>
    %202 = stablehlo.reshape %201 : (tensor<6x2048x6xf32>) -> tensor<6x2048x6x1xf32>
    %203 = stablehlo.divide %202, %71 : tensor<6x2048x6x1xf32>
    %204 = stablehlo.add %203, %73 : tensor<6x2048x6x1xf32>
    %205 = stablehlo.rsqrt %204 : tensor<6x2048x6x1xf32>
    %206 = stablehlo.broadcast_in_dim %205, dims = [0, 1, 2, 3] : (tensor<6x2048x6x1xf32>) -> tensor<6x2048x6x128xf32>
    %207 = stablehlo.multiply %190, %206 : tensor<6x2048x6x128xf32>
    %208 = stablehlo.power %199, %65 : tensor<6x2048x6x128xf32>
    %209 = stablehlo.reduce(%208 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x2048x6x128xf32>, tensor<f32>) -> tensor<6x2048x6xf32>
    %210 = stablehlo.reshape %209 : (tensor<6x2048x6xf32>) -> tensor<6x2048x6x1xf32>
    %211 = stablehlo.divide %210, %71 : tensor<6x2048x6x1xf32>
    %212 = stablehlo.add %211, %73 : tensor<6x2048x6x1xf32>
    %213 = stablehlo.rsqrt %212 : tensor<6x2048x6x1xf32>
    %214 = stablehlo.broadcast_in_dim %213, dims = [0, 1, 2, 3] : (tensor<6x2048x6x1xf32>) -> tensor<6x2048x6x128xf32>
    %215 = stablehlo.multiply %199, %214 : tensor<6x2048x6x128xf32>
    %216 = stablehlo.transpose %207, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %217 = stablehlo.transpose %215, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %218 = stablehlo.transpose %181, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %219 = stablehlo.transpose %217, dims = [0, 1, 3, 2] : (tensor<6x6x2048x128xf32>) -> tensor<6x6x128x2048xf32>
    %220 = stablehlo.reshape %216 : (tensor<6x6x2048x128xf32>) -> tensor<36x2048x128xf32>
    %221 = stablehlo.reshape %219 : (tensor<6x6x128x2048xf32>) -> tensor<36x128x2048xf32>
    %222 = stablehlo.broadcast_in_dim %221, dims = [0, 1, 2] : (tensor<36x128x2048xf32>) -> tensor<36x128x2048xf32>
    %223 = stablehlo.dot_general %220, %222, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<36x2048x128xf32>, tensor<36x128x2048xf32>) -> tensor<36x2048x2048xf32>
    %224 = stablehlo.reshape %223 : (tensor<36x2048x2048xf32>) -> tensor<6x6x2048x2048xf32>
    %225 = stablehlo.multiply %224, %97 : tensor<6x6x2048x2048xf32>
    %226 = stablehlo.broadcast_in_dim %225, dims = [0, 1, 2, 3] : (tensor<6x6x2048x2048xf32>) -> tensor<6x6x2048x2048xf32>
    %227 = stablehlo.select %116, %117, %226 : tensor<6x6x2048x2048xi1>, tensor<6x6x2048x2048xf32>
    %228 = stablehlo.reduce(%227 init: %cst_7) applies stablehlo.maximum across dimensions = [3] : (tensor<6x6x2048x2048xf32>, tensor<f32>) -> tensor<6x6x2048xf32>
    %229 = stablehlo.reshape %228 : (tensor<6x6x2048xf32>) -> tensor<6x6x2048x1xf32>
    %230 = stablehlo.broadcast_in_dim %229, dims = [0, 1, 2, 3] : (tensor<6x6x2048x1xf32>) -> tensor<6x6x2048x2048xf32>
    %231 = stablehlo.subtract %227, %230 : tensor<6x6x2048x2048xf32>
    %232 = stablehlo.exponential %231 : tensor<6x6x2048x2048xf32>
    %233 = stablehlo.reduce(%232 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x6x2048x2048xf32>, tensor<f32>) -> tensor<6x6x2048xf32>
    %234 = stablehlo.reshape %233 : (tensor<6x6x2048xf32>) -> tensor<6x6x2048x1xf32>
    %235 = stablehlo.broadcast_in_dim %234, dims = [0, 1, 2, 3] : (tensor<6x6x2048x1xf32>) -> tensor<6x6x2048x2048xf32>
    %236 = stablehlo.divide %232, %235 : tensor<6x6x2048x2048xf32>
    %237 = stablehlo.reshape %236 : (tensor<6x6x2048x2048xf32>) -> tensor<36x2048x2048xf32>
    %238 = stablehlo.reshape %218 : (tensor<6x6x2048x128xf32>) -> tensor<36x2048x128xf32>
    %239 = stablehlo.broadcast_in_dim %238, dims = [0, 1, 2] : (tensor<36x2048x128xf32>) -> tensor<36x2048x128xf32>
    %240 = stablehlo.dot_general %237, %239, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<36x2048x2048xf32>, tensor<36x2048x128xf32>) -> tensor<36x2048x128xf32>
    %241 = stablehlo.reshape %240 : (tensor<36x2048x128xf32>) -> tensor<6x6x2048x128xf32>
    %242 = stablehlo.transpose %241, dims = [0, 2, 1, 3] : (tensor<6x6x2048x128xf32>) -> tensor<6x2048x6x128xf32>
    %243 = stablehlo.reshape %242 : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x768xf32>
    %244 = stablehlo.transpose %arg10, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %245 = stablehlo.reshape %243 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %246 = stablehlo.dot_general %245, %244, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %247 = stablehlo.reshape %246 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %248 = stablehlo.add %160, %247 : tensor<6x2048x768xf32>
    %249 = stablehlo.power %248, %4 : tensor<6x2048x768xf32>
    %250 = stablehlo.reduce(%249 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<6x2048x768xf32>, tensor<f32>) -> tensor<6x2048xf32>
    %251 = stablehlo.reshape %250 : (tensor<6x2048xf32>) -> tensor<6x2048x1xf32>
    %252 = stablehlo.divide %251, %10 : tensor<6x2048x1xf32>
    %253 = stablehlo.add %252, %14 : tensor<6x2048x1xf32>
    %254 = stablehlo.rsqrt %253 : tensor<6x2048x1xf32>
    %255 = stablehlo.broadcast_in_dim %254, dims = [0, 1, 2] : (tensor<6x2048x1xf32>) -> tensor<6x2048x768xf32>
    %256 = stablehlo.multiply %248, %255 : tensor<6x2048x768xf32>
    %257 = stablehlo.transpose %arg11, dims = [1, 0] : (tensor<3072x768xf32>) -> tensor<768x3072xf32>
    %258 = stablehlo.reshape %256 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %259 = stablehlo.dot_general %258, %257, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x3072xf32>) -> tensor<12288x3072xf32>
    %260 = stablehlo.reshape %259 : (tensor<12288x3072xf32>) -> tensor<6x2048x3072xf32>
    %261 = stablehlo.maximum %260, %cst_11 : tensor<6x2048x3072xf32>
    %262 = stablehlo.power %261, %154 : tensor<6x2048x3072xf32>
    %263 = stablehlo.transpose %arg12, dims = [1, 0] : (tensor<768x3072xf32>) -> tensor<3072x768xf32>
    %264 = stablehlo.reshape %262 : (tensor<6x2048x3072xf32>) -> tensor<12288x3072xf32>
    %265 = stablehlo.dot_general %264, %263, contracting_dims = [1] x [0] : (tensor<12288x3072xf32>, tensor<3072x768xf32>) -> tensor<12288x768xf32>
    %266 = stablehlo.reshape %265 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %267 = stablehlo.add %248, %266 : tensor<6x2048x768xf32>
    %268 = stablehlo.power %267, %4 : tensor<6x2048x768xf32>
    %269 = stablehlo.reduce(%268 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<6x2048x768xf32>, tensor<f32>) -> tensor<6x2048xf32>
    %270 = stablehlo.reshape %269 : (tensor<6x2048xf32>) -> tensor<6x2048x1xf32>
    %271 = stablehlo.divide %270, %10 : tensor<6x2048x1xf32>
    %272 = stablehlo.add %271, %14 : tensor<6x2048x1xf32>
    %273 = stablehlo.rsqrt %272 : tensor<6x2048x1xf32>
    %274 = stablehlo.broadcast_in_dim %273, dims = [0, 1, 2] : (tensor<6x2048x1xf32>) -> tensor<6x2048x768xf32>
    %275 = stablehlo.multiply %267, %274 : tensor<6x2048x768xf32>
    %276 = stablehlo.transpose %arg13, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %277 = stablehlo.reshape %275 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %278 = stablehlo.dot_general %277, %276, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %279 = stablehlo.reshape %278 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %280 = stablehlo.reshape %279 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %281 = stablehlo.transpose %arg14, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %282 = stablehlo.dot_general %277, %281, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %283 = stablehlo.reshape %282 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %284 = stablehlo.reshape %283 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %285 = stablehlo.transpose %arg15, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %286 = stablehlo.dot_general %277, %285, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %287 = stablehlo.reshape %286 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %288 = stablehlo.reshape %287 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %289 = stablehlo.slice %280 [0:6, 0:2048, 0:6, 0:64] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %290 = stablehlo.slice %280 [0:6, 0:2048, 0:6, 64:128] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %291 = stablehlo.multiply %289, %43 : tensor<6x2048x6x64xf32>
    %292 = stablehlo.multiply %290, %46 : tensor<6x2048x6x64xf32>
    %293 = stablehlo.add %291, %292 : tensor<6x2048x6x64xf32>
    %294 = stablehlo.multiply %289, %51 : tensor<6x2048x6x64xf32>
    %295 = stablehlo.multiply %290, %43 : tensor<6x2048x6x64xf32>
    %296 = stablehlo.add %294, %295 : tensor<6x2048x6x64xf32>
    %297 = stablehlo.concatenate %293, %296, dim = 3 : (tensor<6x2048x6x64xf32>, tensor<6x2048x6x64xf32>) -> tensor<6x2048x6x128xf32>
    %298 = stablehlo.slice %284 [0:6, 0:2048, 0:6, 0:64] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %299 = stablehlo.slice %284 [0:6, 0:2048, 0:6, 64:128] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %300 = stablehlo.multiply %298, %43 : tensor<6x2048x6x64xf32>
    %301 = stablehlo.multiply %299, %46 : tensor<6x2048x6x64xf32>
    %302 = stablehlo.add %300, %301 : tensor<6x2048x6x64xf32>
    %303 = stablehlo.multiply %298, %51 : tensor<6x2048x6x64xf32>
    %304 = stablehlo.multiply %299, %43 : tensor<6x2048x6x64xf32>
    %305 = stablehlo.add %303, %304 : tensor<6x2048x6x64xf32>
    %306 = stablehlo.concatenate %302, %305, dim = 3 : (tensor<6x2048x6x64xf32>, tensor<6x2048x6x64xf32>) -> tensor<6x2048x6x128xf32>
    %307 = stablehlo.power %297, %65 : tensor<6x2048x6x128xf32>
    %308 = stablehlo.reduce(%307 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x2048x6x128xf32>, tensor<f32>) -> tensor<6x2048x6xf32>
    %309 = stablehlo.reshape %308 : (tensor<6x2048x6xf32>) -> tensor<6x2048x6x1xf32>
    %310 = stablehlo.divide %309, %71 : tensor<6x2048x6x1xf32>
    %311 = stablehlo.add %310, %73 : tensor<6x2048x6x1xf32>
    %312 = stablehlo.rsqrt %311 : tensor<6x2048x6x1xf32>
    %313 = stablehlo.broadcast_in_dim %312, dims = [0, 1, 2, 3] : (tensor<6x2048x6x1xf32>) -> tensor<6x2048x6x128xf32>
    %314 = stablehlo.multiply %297, %313 : tensor<6x2048x6x128xf32>
    %315 = stablehlo.power %306, %65 : tensor<6x2048x6x128xf32>
    %316 = stablehlo.reduce(%315 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x2048x6x128xf32>, tensor<f32>) -> tensor<6x2048x6xf32>
    %317 = stablehlo.reshape %316 : (tensor<6x2048x6xf32>) -> tensor<6x2048x6x1xf32>
    %318 = stablehlo.divide %317, %71 : tensor<6x2048x6x1xf32>
    %319 = stablehlo.add %318, %73 : tensor<6x2048x6x1xf32>
    %320 = stablehlo.rsqrt %319 : tensor<6x2048x6x1xf32>
    %321 = stablehlo.broadcast_in_dim %320, dims = [0, 1, 2, 3] : (tensor<6x2048x6x1xf32>) -> tensor<6x2048x6x128xf32>
    %322 = stablehlo.multiply %306, %321 : tensor<6x2048x6x128xf32>
    %323 = stablehlo.transpose %314, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %324 = stablehlo.transpose %322, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %325 = stablehlo.transpose %288, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %326 = stablehlo.transpose %324, dims = [0, 1, 3, 2] : (tensor<6x6x2048x128xf32>) -> tensor<6x6x128x2048xf32>
    %327 = stablehlo.reshape %323 : (tensor<6x6x2048x128xf32>) -> tensor<36x2048x128xf32>
    %328 = stablehlo.reshape %326 : (tensor<6x6x128x2048xf32>) -> tensor<36x128x2048xf32>
    %329 = stablehlo.broadcast_in_dim %328, dims = [0, 1, 2] : (tensor<36x128x2048xf32>) -> tensor<36x128x2048xf32>
    %330 = stablehlo.dot_general %327, %329, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<36x2048x128xf32>, tensor<36x128x2048xf32>) -> tensor<36x2048x2048xf32>
    %331 = stablehlo.reshape %330 : (tensor<36x2048x2048xf32>) -> tensor<6x6x2048x2048xf32>
    %332 = stablehlo.multiply %331, %97 : tensor<6x6x2048x2048xf32>
    %333 = stablehlo.broadcast_in_dim %332, dims = [0, 1, 2, 3] : (tensor<6x6x2048x2048xf32>) -> tensor<6x6x2048x2048xf32>
    %334 = stablehlo.select %116, %117, %333 : tensor<6x6x2048x2048xi1>, tensor<6x6x2048x2048xf32>
    %335 = stablehlo.reduce(%334 init: %cst_7) applies stablehlo.maximum across dimensions = [3] : (tensor<6x6x2048x2048xf32>, tensor<f32>) -> tensor<6x6x2048xf32>
    %336 = stablehlo.reshape %335 : (tensor<6x6x2048xf32>) -> tensor<6x6x2048x1xf32>
    %337 = stablehlo.broadcast_in_dim %336, dims = [0, 1, 2, 3] : (tensor<6x6x2048x1xf32>) -> tensor<6x6x2048x2048xf32>
    %338 = stablehlo.subtract %334, %337 : tensor<6x6x2048x2048xf32>
    %339 = stablehlo.exponential %338 : tensor<6x6x2048x2048xf32>
    %340 = stablehlo.reduce(%339 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x6x2048x2048xf32>, tensor<f32>) -> tensor<6x6x2048xf32>
    %341 = stablehlo.reshape %340 : (tensor<6x6x2048xf32>) -> tensor<6x6x2048x1xf32>
    %342 = stablehlo.broadcast_in_dim %341, dims = [0, 1, 2, 3] : (tensor<6x6x2048x1xf32>) -> tensor<6x6x2048x2048xf32>
    %343 = stablehlo.divide %339, %342 : tensor<6x6x2048x2048xf32>
    %344 = stablehlo.reshape %343 : (tensor<6x6x2048x2048xf32>) -> tensor<36x2048x2048xf32>
    %345 = stablehlo.reshape %325 : (tensor<6x6x2048x128xf32>) -> tensor<36x2048x128xf32>
    %346 = stablehlo.broadcast_in_dim %345, dims = [0, 1, 2] : (tensor<36x2048x128xf32>) -> tensor<36x2048x128xf32>
    %347 = stablehlo.dot_general %344, %346, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<36x2048x2048xf32>, tensor<36x2048x128xf32>) -> tensor<36x2048x128xf32>
    %348 = stablehlo.reshape %347 : (tensor<36x2048x128xf32>) -> tensor<6x6x2048x128xf32>
    %349 = stablehlo.transpose %348, dims = [0, 2, 1, 3] : (tensor<6x6x2048x128xf32>) -> tensor<6x2048x6x128xf32>
    %350 = stablehlo.reshape %349 : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x768xf32>
    %351 = stablehlo.transpose %arg16, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %352 = stablehlo.reshape %350 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %353 = stablehlo.dot_general %352, %351, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %354 = stablehlo.reshape %353 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %355 = stablehlo.add %267, %354 : tensor<6x2048x768xf32>
    %356 = stablehlo.power %355, %4 : tensor<6x2048x768xf32>
    %357 = stablehlo.reduce(%356 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<6x2048x768xf32>, tensor<f32>) -> tensor<6x2048xf32>
    %358 = stablehlo.reshape %357 : (tensor<6x2048xf32>) -> tensor<6x2048x1xf32>
    %359 = stablehlo.divide %358, %10 : tensor<6x2048x1xf32>
    %360 = stablehlo.add %359, %14 : tensor<6x2048x1xf32>
    %361 = stablehlo.rsqrt %360 : tensor<6x2048x1xf32>
    %362 = stablehlo.broadcast_in_dim %361, dims = [0, 1, 2] : (tensor<6x2048x1xf32>) -> tensor<6x2048x768xf32>
    %363 = stablehlo.multiply %355, %362 : tensor<6x2048x768xf32>
    %364 = stablehlo.transpose %arg17, dims = [1, 0] : (tensor<3072x768xf32>) -> tensor<768x3072xf32>
    %365 = stablehlo.reshape %363 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %366 = stablehlo.dot_general %365, %364, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x3072xf32>) -> tensor<12288x3072xf32>
    %367 = stablehlo.reshape %366 : (tensor<12288x3072xf32>) -> tensor<6x2048x3072xf32>
    %368 = stablehlo.maximum %367, %cst_11 : tensor<6x2048x3072xf32>
    %369 = stablehlo.power %368, %154 : tensor<6x2048x3072xf32>
    %370 = stablehlo.transpose %arg18, dims = [1, 0] : (tensor<768x3072xf32>) -> tensor<3072x768xf32>
    %371 = stablehlo.reshape %369 : (tensor<6x2048x3072xf32>) -> tensor<12288x3072xf32>
    %372 = stablehlo.dot_general %371, %370, contracting_dims = [1] x [0] : (tensor<12288x3072xf32>, tensor<3072x768xf32>) -> tensor<12288x768xf32>
    %373 = stablehlo.reshape %372 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %374 = stablehlo.add %355, %373 : tensor<6x2048x768xf32>
    %375 = stablehlo.power %374, %4 : tensor<6x2048x768xf32>
    %376 = stablehlo.reduce(%375 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<6x2048x768xf32>, tensor<f32>) -> tensor<6x2048xf32>
    %377 = stablehlo.reshape %376 : (tensor<6x2048xf32>) -> tensor<6x2048x1xf32>
    %378 = stablehlo.divide %377, %10 : tensor<6x2048x1xf32>
    %379 = stablehlo.add %378, %14 : tensor<6x2048x1xf32>
    %380 = stablehlo.rsqrt %379 : tensor<6x2048x1xf32>
    %381 = stablehlo.broadcast_in_dim %380, dims = [0, 1, 2] : (tensor<6x2048x1xf32>) -> tensor<6x2048x768xf32>
    %382 = stablehlo.multiply %374, %381 : tensor<6x2048x768xf32>
    %383 = stablehlo.transpose %arg19, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %384 = stablehlo.reshape %382 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %385 = stablehlo.dot_general %384, %383, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %386 = stablehlo.reshape %385 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %387 = stablehlo.reshape %386 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %388 = stablehlo.transpose %arg20, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %389 = stablehlo.dot_general %384, %388, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %390 = stablehlo.reshape %389 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %391 = stablehlo.reshape %390 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %392 = stablehlo.transpose %arg21, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %393 = stablehlo.dot_general %384, %392, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %394 = stablehlo.reshape %393 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %395 = stablehlo.reshape %394 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %396 = stablehlo.slice %387 [0:6, 0:2048, 0:6, 0:64] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %397 = stablehlo.slice %387 [0:6, 0:2048, 0:6, 64:128] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %398 = stablehlo.multiply %396, %43 : tensor<6x2048x6x64xf32>
    %399 = stablehlo.multiply %397, %46 : tensor<6x2048x6x64xf32>
    %400 = stablehlo.add %398, %399 : tensor<6x2048x6x64xf32>
    %401 = stablehlo.multiply %396, %51 : tensor<6x2048x6x64xf32>
    %402 = stablehlo.multiply %397, %43 : tensor<6x2048x6x64xf32>
    %403 = stablehlo.add %401, %402 : tensor<6x2048x6x64xf32>
    %404 = stablehlo.concatenate %400, %403, dim = 3 : (tensor<6x2048x6x64xf32>, tensor<6x2048x6x64xf32>) -> tensor<6x2048x6x128xf32>
    %405 = stablehlo.slice %391 [0:6, 0:2048, 0:6, 0:64] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %406 = stablehlo.slice %391 [0:6, 0:2048, 0:6, 64:128] : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x6x64xf32>
    %407 = stablehlo.multiply %405, %43 : tensor<6x2048x6x64xf32>
    %408 = stablehlo.multiply %406, %46 : tensor<6x2048x6x64xf32>
    %409 = stablehlo.add %407, %408 : tensor<6x2048x6x64xf32>
    %410 = stablehlo.multiply %405, %51 : tensor<6x2048x6x64xf32>
    %411 = stablehlo.multiply %406, %43 : tensor<6x2048x6x64xf32>
    %412 = stablehlo.add %410, %411 : tensor<6x2048x6x64xf32>
    %413 = stablehlo.concatenate %409, %412, dim = 3 : (tensor<6x2048x6x64xf32>, tensor<6x2048x6x64xf32>) -> tensor<6x2048x6x128xf32>
    %414 = stablehlo.power %404, %65 : tensor<6x2048x6x128xf32>
    %415 = stablehlo.reduce(%414 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x2048x6x128xf32>, tensor<f32>) -> tensor<6x2048x6xf32>
    %416 = stablehlo.reshape %415 : (tensor<6x2048x6xf32>) -> tensor<6x2048x6x1xf32>
    %417 = stablehlo.divide %416, %71 : tensor<6x2048x6x1xf32>
    %418 = stablehlo.add %417, %73 : tensor<6x2048x6x1xf32>
    %419 = stablehlo.rsqrt %418 : tensor<6x2048x6x1xf32>
    %420 = stablehlo.broadcast_in_dim %419, dims = [0, 1, 2, 3] : (tensor<6x2048x6x1xf32>) -> tensor<6x2048x6x128xf32>
    %421 = stablehlo.multiply %404, %420 : tensor<6x2048x6x128xf32>
    %422 = stablehlo.power %413, %65 : tensor<6x2048x6x128xf32>
    %423 = stablehlo.reduce(%422 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x2048x6x128xf32>, tensor<f32>) -> tensor<6x2048x6xf32>
    %424 = stablehlo.reshape %423 : (tensor<6x2048x6xf32>) -> tensor<6x2048x6x1xf32>
    %425 = stablehlo.divide %424, %71 : tensor<6x2048x6x1xf32>
    %426 = stablehlo.add %425, %73 : tensor<6x2048x6x1xf32>
    %427 = stablehlo.rsqrt %426 : tensor<6x2048x6x1xf32>
    %428 = stablehlo.broadcast_in_dim %427, dims = [0, 1, 2, 3] : (tensor<6x2048x6x1xf32>) -> tensor<6x2048x6x128xf32>
    %429 = stablehlo.multiply %413, %428 : tensor<6x2048x6x128xf32>
    %430 = stablehlo.transpose %421, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %431 = stablehlo.transpose %429, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %432 = stablehlo.transpose %395, dims = [0, 2, 1, 3] : (tensor<6x2048x6x128xf32>) -> tensor<6x6x2048x128xf32>
    %433 = stablehlo.transpose %431, dims = [0, 1, 3, 2] : (tensor<6x6x2048x128xf32>) -> tensor<6x6x128x2048xf32>
    %434 = stablehlo.reshape %430 : (tensor<6x6x2048x128xf32>) -> tensor<36x2048x128xf32>
    %435 = stablehlo.reshape %433 : (tensor<6x6x128x2048xf32>) -> tensor<36x128x2048xf32>
    %436 = stablehlo.broadcast_in_dim %435, dims = [0, 1, 2] : (tensor<36x128x2048xf32>) -> tensor<36x128x2048xf32>
    %437 = stablehlo.dot_general %434, %436, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<36x2048x128xf32>, tensor<36x128x2048xf32>) -> tensor<36x2048x2048xf32>
    %438 = stablehlo.reshape %437 : (tensor<36x2048x2048xf32>) -> tensor<6x6x2048x2048xf32>
    %439 = stablehlo.multiply %438, %97 : tensor<6x6x2048x2048xf32>
    %440 = stablehlo.broadcast_in_dim %439, dims = [0, 1, 2, 3] : (tensor<6x6x2048x2048xf32>) -> tensor<6x6x2048x2048xf32>
    %441 = stablehlo.select %116, %117, %440 : tensor<6x6x2048x2048xi1>, tensor<6x6x2048x2048xf32>
    %442 = stablehlo.reduce(%441 init: %cst_7) applies stablehlo.maximum across dimensions = [3] : (tensor<6x6x2048x2048xf32>, tensor<f32>) -> tensor<6x6x2048xf32>
    %443 = stablehlo.reshape %442 : (tensor<6x6x2048xf32>) -> tensor<6x6x2048x1xf32>
    %444 = stablehlo.broadcast_in_dim %443, dims = [0, 1, 2, 3] : (tensor<6x6x2048x1xf32>) -> tensor<6x6x2048x2048xf32>
    %445 = stablehlo.subtract %441, %444 : tensor<6x6x2048x2048xf32>
    %446 = stablehlo.exponential %445 : tensor<6x6x2048x2048xf32>
    %447 = stablehlo.reduce(%446 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<6x6x2048x2048xf32>, tensor<f32>) -> tensor<6x6x2048xf32>
    %448 = stablehlo.reshape %447 : (tensor<6x6x2048xf32>) -> tensor<6x6x2048x1xf32>
    %449 = stablehlo.broadcast_in_dim %448, dims = [0, 1, 2, 3] : (tensor<6x6x2048x1xf32>) -> tensor<6x6x2048x2048xf32>
    %450 = stablehlo.divide %446, %449 : tensor<6x6x2048x2048xf32>
    %451 = stablehlo.reshape %450 : (tensor<6x6x2048x2048xf32>) -> tensor<36x2048x2048xf32>
    %452 = stablehlo.reshape %432 : (tensor<6x6x2048x128xf32>) -> tensor<36x2048x128xf32>
    %453 = stablehlo.broadcast_in_dim %452, dims = [0, 1, 2] : (tensor<36x2048x128xf32>) -> tensor<36x2048x128xf32>
    %454 = stablehlo.dot_general %451, %453, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<36x2048x2048xf32>, tensor<36x2048x128xf32>) -> tensor<36x2048x128xf32>
    %455 = stablehlo.reshape %454 : (tensor<36x2048x128xf32>) -> tensor<6x6x2048x128xf32>
    %456 = stablehlo.transpose %455, dims = [0, 2, 1, 3] : (tensor<6x6x2048x128xf32>) -> tensor<6x2048x6x128xf32>
    %457 = stablehlo.reshape %456 : (tensor<6x2048x6x128xf32>) -> tensor<6x2048x768xf32>
    %458 = stablehlo.transpose %arg22, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %459 = stablehlo.reshape %457 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %460 = stablehlo.dot_general %459, %458, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %461 = stablehlo.reshape %460 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %462 = stablehlo.add %374, %461 : tensor<6x2048x768xf32>
    %463 = stablehlo.power %462, %4 : tensor<6x2048x768xf32>
    %464 = stablehlo.reduce(%463 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<6x2048x768xf32>, tensor<f32>) -> tensor<6x2048xf32>
    %465 = stablehlo.reshape %464 : (tensor<6x2048xf32>) -> tensor<6x2048x1xf32>
    %466 = stablehlo.divide %465, %10 : tensor<6x2048x1xf32>
    %467 = stablehlo.add %466, %14 : tensor<6x2048x1xf32>
    %468 = stablehlo.rsqrt %467 : tensor<6x2048x1xf32>
    %469 = stablehlo.broadcast_in_dim %468, dims = [0, 1, 2] : (tensor<6x2048x1xf32>) -> tensor<6x2048x768xf32>
    %470 = stablehlo.multiply %462, %469 : tensor<6x2048x768xf32>
    %471 = stablehlo.transpose %arg23, dims = [1, 0] : (tensor<3072x768xf32>) -> tensor<768x3072xf32>
    %472 = stablehlo.reshape %470 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %473 = stablehlo.dot_general %472, %471, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x3072xf32>) -> tensor<12288x3072xf32>
    %474 = stablehlo.reshape %473 : (tensor<12288x3072xf32>) -> tensor<6x2048x3072xf32>
    %475 = stablehlo.maximum %474, %cst_11 : tensor<6x2048x3072xf32>
    %476 = stablehlo.power %475, %154 : tensor<6x2048x3072xf32>
    %477 = stablehlo.transpose %arg24, dims = [1, 0] : (tensor<768x3072xf32>) -> tensor<3072x768xf32>
    %478 = stablehlo.reshape %476 : (tensor<6x2048x3072xf32>) -> tensor<12288x3072xf32>
    %479 = stablehlo.dot_general %478, %477, contracting_dims = [1] x [0] : (tensor<12288x3072xf32>, tensor<3072x768xf32>) -> tensor<12288x768xf32>
    %480 = stablehlo.reshape %479 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %481 = stablehlo.add %462, %480 : tensor<6x2048x768xf32>
    %482 = stablehlo.power %481, %4 : tensor<6x2048x768xf32>
    %483 = stablehlo.reduce(%482 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<6x2048x768xf32>, tensor<f32>) -> tensor<6x2048xf32>
    %484 = stablehlo.reshape %483 : (tensor<6x2048xf32>) -> tensor<6x2048x1xf32>
    %485 = stablehlo.divide %484, %10 : tensor<6x2048x1xf32>
    %486 = stablehlo.add %485, %14 : tensor<6x2048x1xf32>
    %487 = stablehlo.rsqrt %486 : tensor<6x2048x1xf32>
    %488 = stablehlo.broadcast_in_dim %487, dims = [0, 1, 2] : (tensor<6x2048x1xf32>) -> tensor<6x2048x768xf32>
    %489 = stablehlo.multiply %481, %488 : tensor<6x2048x768xf32>
    %490 = stablehlo.transpose %arg25, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %491 = stablehlo.reshape %489 : (tensor<6x2048x768xf32>) -> tensor<12288x768xf32>
    %492 = stablehlo.dot_general %491, %490, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %493 = stablehlo.reshape %492 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %494 = stablehlo.reshape %493 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %495 = stablehlo.transpose %arg26, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %496 = stablehlo.dot_general %491, %495, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
    %497 = stablehlo.reshape %496 : (tensor<12288x768xf32>) -> tensor<6x2048x768xf32>
    %498 = stablehlo.reshape %497 : (tensor<6x2048x768xf32>) -> tensor<6x2048x6x128xf32>
    %499 = stablehlo.transpose %arg27, dims = [1, 0] : (tensor<768x768xf32>) -> tensor<768x768xf32>
    %500 = stablehlo.dot_general %491, %499, contracting_dims = [1] x [0] : (tensor<12288x768xf32>, tensor<768x768xf32>) -> tensor<12288x768xf32>
