module {
  func.func @main(%arg0: tensor<65536x128xf32>, %arg1: tensor<128x128xf32>, %arg2: tensor<128x128xf32>, %arg3: tensor<128x128xf32>, %arg4: tensor<128x128xf32>, %arg5: tensor<512x128xf32>, %arg6: tensor<128x512xf32>, %arg7: tensor<128x128xf32>, %arg8: tensor<128x128xf32>, %arg9: tensor<128x128xf32>, %arg10: tensor<128x128xf32>, %arg11: tensor<512x128xf32>, %arg12: tensor<128x512xf32>, %arg13: tensor<65536x128xf32>, %arg14: tensor<1x256xi64>, %arg15: tensor<1x256xi64>) -> tensor<f32> {
    %c = stablehlo.constant dense<-1> : tensor<256xi64>
    %c_0 = stablehlo.constant dense<1> : tensor<256x256xi64>
    %c_1 = stablehlo.constant dense<0> : tensor<256xi64>
    %c_2 = stablehlo.constant dense<1> : tensor<256xi64>
    %c_3 = stablehlo.constant dense<256> : tensor<i64>
    %c_4 = stablehlo.constant dense<1> : tensor<i64>
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %c_5 = stablehlo.constant dense<0> : tensor<i64>
    %cst_6 = stablehlo.constant dense<0xFF800000> : tensor<f32>
    %c_7 = stablehlo.constant dense<true> : tensor<256x256xi1>
    %cst_8 = stablehlo.constant dense_resource<torch_tensor_1_256_1_16_torch.bfloat16_1> : tensor<1x256x1x16xbf16>
    %cst_9 = stablehlo.constant dense_resource<torch_tensor_1_256_1_16_torch.bfloat16> : tensor<1x256x1x16xbf16>
    %cst_10 = stablehlo.constant dense<0.000000e+00> : tensor<1x256x512xf32>
    %cst_11 = arith.constant dense<2> : tensor<1xi64>
    %cst_12 = arith.constant dense<128> : tensor<1xi64>
    %cst_13 = arith.constant dense<1.000000e-05> : tensor<1xf64>
    %cst_14 = arith.constant dense<32> : tensor<1xi64>
    %cst_15 = arith.constant dense<0.17677669529663687> : tensor<1xf64>
    %cst_16 = arith.constant dense<15> : tensor<1xi64>
    %0 = "stablehlo.gather"(%arg0, %arg14) <{dimension_numbers = #stablehlo.gather<offset_dims = [2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 2>, indices_are_sorted = false, slice_sizes = array<i64: 1, 128>}> : (tensor<65536x128xf32>, tensor<1x256xi64>) -> tensor<1x256x128xf32>
    %1 = stablehlo.convert %0 : tensor<1x256x128xf32>
    %2 = stablehlo.convert %cst_11 : (tensor<1xi64>) -> tensor<1xf32>
    %3 = stablehlo.reshape %2 : (tensor<1xf32>) -> tensor<f32>
    %4 = stablehlo.broadcast_in_dim %3, dims = [] : (tensor<f32>) -> tensor<1x256x128xf32>
    %5 = stablehlo.power %1, %4 : tensor<1x256x128xf32>
    %6 = stablehlo.reduce(%5 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x256x128xf32>, tensor<f32>) -> tensor<1x256xf32>
    %7 = stablehlo.reshape %6 : (tensor<1x256xf32>) -> tensor<1x256x1xf32>
    %8 = stablehlo.convert %cst_12 : (tensor<1xi64>) -> tensor<1xf32>
    %9 = stablehlo.reshape %8 : (tensor<1xf32>) -> tensor<f32>
    %10 = stablehlo.broadcast_in_dim %9, dims = [] : (tensor<f32>) -> tensor<1x256x1xf32>
    %11 = stablehlo.divide %7, %10 : tensor<1x256x1xf32>
    %12 = stablehlo.convert %cst_13 : (tensor<1xf64>) -> tensor<1xf32>
    %13 = stablehlo.reshape %12 : (tensor<1xf32>) -> tensor<f32>
    %14 = stablehlo.broadcast_in_dim %13, dims = [] : (tensor<f32>) -> tensor<1x256x1xf32>
    %15 = stablehlo.add %11, %14 : tensor<1x256x1xf32>
    %16 = stablehlo.rsqrt %15 : tensor<1x256x1xf32>
    %17 = stablehlo.broadcast_in_dim %16, dims = [0, 1, 2] : (tensor<1x256x1xf32>) -> tensor<1x256x128xf32>
    %18 = stablehlo.multiply %1, %17 : tensor<1x256x128xf32>
    %19 = stablehlo.power %18, %4 : tensor<1x256x128xf32>
    %20 = stablehlo.reduce(%19 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x256x128xf32>, tensor<f32>) -> tensor<1x256xf32>
    %21 = stablehlo.reshape %20 : (tensor<1x256xf32>) -> tensor<1x256x1xf32>
    %22 = stablehlo.divide %21, %10 : tensor<1x256x1xf32>
    %23 = stablehlo.add %22, %14 : tensor<1x256x1xf32>
    %24 = stablehlo.rsqrt %23 : tensor<1x256x1xf32>
    %25 = stablehlo.broadcast_in_dim %24, dims = [0, 1, 2] : (tensor<1x256x1xf32>) -> tensor<1x256x128xf32>
    %26 = stablehlo.multiply %18, %25 : tensor<1x256x128xf32>
    %27 = stablehlo.transpose %arg1, dims = [1, 0] : (tensor<128x128xf32>) -> tensor<128x128xf32>
    %28 = stablehlo.reshape %26 : (tensor<1x256x128xf32>) -> tensor<256x128xf32>
    %29 = stablehlo.dot_general %28, %27, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x128xf32>) -> tensor<256x128xf32>
    %30 = stablehlo.reshape %29 : (tensor<256x128xf32>) -> tensor<1x256x128xf32>
    %31 = stablehlo.reshape %30 : (tensor<1x256x128xf32>) -> tensor<1x256x4x32xf32>
    %32 = stablehlo.transpose %arg2, dims = [1, 0] : (tensor<128x128xf32>) -> tensor<128x128xf32>
    %33 = stablehlo.dot_general %28, %32, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x128xf32>) -> tensor<256x128xf32>
    %34 = stablehlo.reshape %33 : (tensor<256x128xf32>) -> tensor<1x256x128xf32>
    %35 = stablehlo.reshape %34 : (tensor<1x256x128xf32>) -> tensor<1x256x4x32xf32>
    %36 = stablehlo.transpose %arg3, dims = [1, 0] : (tensor<128x128xf32>) -> tensor<128x128xf32>
    %37 = stablehlo.dot_general %28, %36, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x128xf32>) -> tensor<256x128xf32>
    %38 = stablehlo.reshape %37 : (tensor<256x128xf32>) -> tensor<1x256x128xf32>
    %39 = stablehlo.reshape %38 : (tensor<1x256x128xf32>) -> tensor<1x256x4x32xf32>
    %40 = stablehlo.slice %31 [0:1, 0:256, 0:4, 0:16] : (tensor<1x256x4x32xf32>) -> tensor<1x256x4x16xf32>
    %41 = stablehlo.slice %31 [0:1, 0:256, 0:4, 16:32] : (tensor<1x256x4x32xf32>) -> tensor<1x256x4x16xf32>
    %42 = stablehlo.convert %cst_9 : (tensor<1x256x1x16xbf16>) -> tensor<1x256x1x16xf32>
    %43 = stablehlo.broadcast_in_dim %42, dims = [0, 1, 2, 3] : (tensor<1x256x1x16xf32>) -> tensor<1x256x4x16xf32>
    %44 = stablehlo.multiply %40, %43 : tensor<1x256x4x16xf32>
    %45 = stablehlo.convert %cst_8 : (tensor<1x256x1x16xbf16>) -> tensor<1x256x1x16xf32>
    %46 = stablehlo.broadcast_in_dim %45, dims = [0, 1, 2, 3] : (tensor<1x256x1x16xf32>) -> tensor<1x256x4x16xf32>
    %47 = stablehlo.multiply %41, %46 : tensor<1x256x4x16xf32>
    %48 = stablehlo.add %44, %47 : tensor<1x256x4x16xf32>
    %49 = stablehlo.negate %cst_8 : tensor<1x256x1x16xbf16>
    %50 = stablehlo.convert %49 : (tensor<1x256x1x16xbf16>) -> tensor<1x256x1x16xf32>
    %51 = stablehlo.broadcast_in_dim %50, dims = [0, 1, 2, 3] : (tensor<1x256x1x16xf32>) -> tensor<1x256x4x16xf32>
    %52 = stablehlo.multiply %40, %51 : tensor<1x256x4x16xf32>
    %53 = stablehlo.multiply %41, %43 : tensor<1x256x4x16xf32>
    %54 = stablehlo.add %52, %53 : tensor<1x256x4x16xf32>
    %55 = stablehlo.concatenate %48, %54, dim = 3 : (tensor<1x256x4x16xf32>, tensor<1x256x4x16xf32>) -> tensor<1x256x4x32xf32>
    %56 = stablehlo.slice %35 [0:1, 0:256, 0:4, 0:16] : (tensor<1x256x4x32xf32>) -> tensor<1x256x4x16xf32>
    %57 = stablehlo.slice %35 [0:1, 0:256, 0:4, 16:32] : (tensor<1x256x4x32xf32>) -> tensor<1x256x4x16xf32>
    %58 = stablehlo.multiply %56, %43 : tensor<1x256x4x16xf32>
    %59 = stablehlo.multiply %57, %46 : tensor<1x256x4x16xf32>
    %60 = stablehlo.add %58, %59 : tensor<1x256x4x16xf32>
    %61 = stablehlo.multiply %56, %51 : tensor<1x256x4x16xf32>
    %62 = stablehlo.multiply %57, %43 : tensor<1x256x4x16xf32>
    %63 = stablehlo.add %61, %62 : tensor<1x256x4x16xf32>
    %64 = stablehlo.concatenate %60, %63, dim = 3 : (tensor<1x256x4x16xf32>, tensor<1x256x4x16xf32>) -> tensor<1x256x4x32xf32>
    %65 = stablehlo.broadcast_in_dim %3, dims = [] : (tensor<f32>) -> tensor<1x256x4x32xf32>
    %66 = stablehlo.power %55, %65 : tensor<1x256x4x32xf32>
    %67 = stablehlo.reduce(%66 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x256x4x32xf32>, tensor<f32>) -> tensor<1x256x4xf32>
    %68 = stablehlo.reshape %67 : (tensor<1x256x4xf32>) -> tensor<1x256x4x1xf32>
    %69 = stablehlo.convert %cst_14 : (tensor<1xi64>) -> tensor<1xf32>
    %70 = stablehlo.reshape %69 : (tensor<1xf32>) -> tensor<f32>
    %71 = stablehlo.broadcast_in_dim %70, dims = [] : (tensor<f32>) -> tensor<1x256x4x1xf32>
    %72 = stablehlo.divide %68, %71 : tensor<1x256x4x1xf32>
    %73 = stablehlo.broadcast_in_dim %13, dims = [] : (tensor<f32>) -> tensor<1x256x4x1xf32>
    %74 = stablehlo.add %72, %73 : tensor<1x256x4x1xf32>
    %75 = stablehlo.rsqrt %74 : tensor<1x256x4x1xf32>
    %76 = stablehlo.broadcast_in_dim %75, dims = [0, 1, 2, 3] : (tensor<1x256x4x1xf32>) -> tensor<1x256x4x32xf32>
    %77 = stablehlo.multiply %55, %76 : tensor<1x256x4x32xf32>
    %78 = stablehlo.power %64, %65 : tensor<1x256x4x32xf32>
    %79 = stablehlo.reduce(%78 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x256x4x32xf32>, tensor<f32>) -> tensor<1x256x4xf32>
    %80 = stablehlo.reshape %79 : (tensor<1x256x4xf32>) -> tensor<1x256x4x1xf32>
    %81 = stablehlo.divide %80, %71 : tensor<1x256x4x1xf32>
    %82 = stablehlo.add %81, %73 : tensor<1x256x4x1xf32>
    %83 = stablehlo.rsqrt %82 : tensor<1x256x4x1xf32>
    %84 = stablehlo.broadcast_in_dim %83, dims = [0, 1, 2, 3] : (tensor<1x256x4x1xf32>) -> tensor<1x256x4x32xf32>
    %85 = stablehlo.multiply %64, %84 : tensor<1x256x4x32xf32>
    %86 = stablehlo.transpose %77, dims = [0, 2, 1, 3] : (tensor<1x256x4x32xf32>) -> tensor<1x4x256x32xf32>
    %87 = stablehlo.transpose %85, dims = [0, 2, 1, 3] : (tensor<1x256x4x32xf32>) -> tensor<1x4x256x32xf32>
    %88 = stablehlo.transpose %39, dims = [0, 2, 1, 3] : (tensor<1x256x4x32xf32>) -> tensor<1x4x256x32xf32>
    %89 = stablehlo.transpose %87, dims = [0, 1, 3, 2] : (tensor<1x4x256x32xf32>) -> tensor<1x4x32x256xf32>
    %90 = stablehlo.reshape %86 : (tensor<1x4x256x32xf32>) -> tensor<4x256x32xf32>
    %91 = stablehlo.reshape %89 : (tensor<1x4x32x256xf32>) -> tensor<4x32x256xf32>
    %92 = stablehlo.broadcast_in_dim %91, dims = [0, 1, 2] : (tensor<4x32x256xf32>) -> tensor<4x32x256xf32>
    %93 = stablehlo.dot_general %90, %92, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<4x256x32xf32>, tensor<4x32x256xf32>) -> tensor<4x256x256xf32>
    %94 = stablehlo.reshape %93 : (tensor<4x256x256xf32>) -> tensor<1x4x256x256xf32>
    %95 = stablehlo.convert %cst_15 : (tensor<1xf64>) -> tensor<1xf32>
    %96 = stablehlo.reshape %95 : (tensor<1xf32>) -> tensor<f32>
    %97 = stablehlo.broadcast_in_dim %96, dims = [] : (tensor<f32>) -> tensor<1x4x256x256xf32>
    %98 = stablehlo.multiply %94, %97 : tensor<1x4x256x256xf32>
    %99 = stablehlo.convert %c_4 : (tensor<i64>) -> tensor<f64>
    %100 = stablehlo.convert %c_3 : (tensor<i64>) -> tensor<f64>
    %101 = stablehlo.divide %100, %99 : tensor<f64>
    %102 = stablehlo.ceil %101 : tensor<f64>
    %103 = stablehlo.convert %102 : (tensor<f64>) -> tensor<i64>
    %104 = stablehlo.reshape %103 : (tensor<i64>) -> tensor<1xi64>
    %105 = stablehlo.dynamic_iota %104, dim = 0 : (tensor<1xi64>) -> tensor<256xi64>
    %106 = stablehlo.multiply %105, %c_2 : tensor<256xi64>
    %107 = stablehlo.add %106, %c_1 : tensor<256xi64>
    %108 = stablehlo.reshape %107 : (tensor<256xi64>) -> tensor<1x256xi64>
    %109 = stablehlo.reshape %107 : (tensor<256xi64>) -> tensor<256x1xi64>
    %110 = stablehlo.broadcast_in_dim %108, dims = [0, 1] : (tensor<1x256xi64>) -> tensor<256x256xi64>
    %111 = stablehlo.broadcast_in_dim %109, dims = [0, 1] : (tensor<256x1xi64>) -> tensor<256x256xi64>
    %112 = stablehlo.subtract %110, %111 : tensor<256x256xi64>
    %113 = stablehlo.compare  GE, %112, %c_0,  SIGNED : (tensor<256x256xi64>, tensor<256x256xi64>) -> tensor<256x256xi1>
    %114 = stablehlo.and %113, %c_7 : tensor<256x256xi1>
    %115 = stablehlo.reshape %114 : (tensor<256x256xi1>) -> tensor<1x1x256x256xi1>
    %116 = stablehlo.broadcast_in_dim %115, dims = [0, 1, 2, 3] : (tensor<1x1x256x256xi1>) -> tensor<1x4x256x256xi1>
    %117 = stablehlo.broadcast_in_dim %cst_6, dims = [] : (tensor<f32>) -> tensor<1x4x256x256xf32>
    %118 = stablehlo.broadcast_in_dim %98, dims = [0, 1, 2, 3] : (tensor<1x4x256x256xf32>) -> tensor<1x4x256x256xf32>
    %119 = stablehlo.select %116, %117, %118 : tensor<1x4x256x256xi1>, tensor<1x4x256x256xf32>
    %120 = stablehlo.reduce(%119 init: %cst_6) applies stablehlo.maximum across dimensions = [3] : (tensor<1x4x256x256xf32>, tensor<f32>) -> tensor<1x4x256xf32>
    %121 = stablehlo.reshape %120 : (tensor<1x4x256xf32>) -> tensor<1x4x256x1xf32>
    %122 = stablehlo.broadcast_in_dim %121, dims = [0, 1, 2, 3] : (tensor<1x4x256x1xf32>) -> tensor<1x4x256x256xf32>
    %123 = stablehlo.subtract %119, %122 : tensor<1x4x256x256xf32>
    %124 = stablehlo.exponential %123 : tensor<1x4x256x256xf32>
    %125 = stablehlo.reduce(%124 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x4x256x256xf32>, tensor<f32>) -> tensor<1x4x256xf32>
    %126 = stablehlo.reshape %125 : (tensor<1x4x256xf32>) -> tensor<1x4x256x1xf32>
    %127 = stablehlo.broadcast_in_dim %126, dims = [0, 1, 2, 3] : (tensor<1x4x256x1xf32>) -> tensor<1x4x256x256xf32>
    %128 = stablehlo.divide %124, %127 : tensor<1x4x256x256xf32>
    %129 = stablehlo.reshape %128 : (tensor<1x4x256x256xf32>) -> tensor<4x256x256xf32>
    %130 = stablehlo.reshape %88 : (tensor<1x4x256x32xf32>) -> tensor<4x256x32xf32>
    %131 = stablehlo.broadcast_in_dim %130, dims = [0, 1, 2] : (tensor<4x256x32xf32>) -> tensor<4x256x32xf32>
    %132 = stablehlo.dot_general %129, %131, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<4x256x256xf32>, tensor<4x256x32xf32>) -> tensor<4x256x32xf32>
    %133 = stablehlo.reshape %132 : (tensor<4x256x32xf32>) -> tensor<1x4x256x32xf32>
    %134 = stablehlo.transpose %133, dims = [0, 2, 1, 3] : (tensor<1x4x256x32xf32>) -> tensor<1x256x4x32xf32>
    %135 = stablehlo.reshape %134 : (tensor<1x256x4x32xf32>) -> tensor<1x256x128xf32>
    %136 = stablehlo.transpose %arg4, dims = [1, 0] : (tensor<128x128xf32>) -> tensor<128x128xf32>
    %137 = stablehlo.reshape %135 : (tensor<1x256x128xf32>) -> tensor<256x128xf32>
    %138 = stablehlo.dot_general %137, %136, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x128xf32>) -> tensor<256x128xf32>
    %139 = stablehlo.reshape %138 : (tensor<256x128xf32>) -> tensor<1x256x128xf32>
    %140 = stablehlo.add %18, %139 : tensor<1x256x128xf32>
    %141 = stablehlo.power %140, %4 : tensor<1x256x128xf32>
    %142 = stablehlo.reduce(%141 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x256x128xf32>, tensor<f32>) -> tensor<1x256xf32>
    %143 = stablehlo.reshape %142 : (tensor<1x256xf32>) -> tensor<1x256x1xf32>
    %144 = stablehlo.divide %143, %10 : tensor<1x256x1xf32>
    %145 = stablehlo.add %144, %14 : tensor<1x256x1xf32>
    %146 = stablehlo.rsqrt %145 : tensor<1x256x1xf32>
    %147 = stablehlo.broadcast_in_dim %146, dims = [0, 1, 2] : (tensor<1x256x1xf32>) -> tensor<1x256x128xf32>
    %148 = stablehlo.multiply %140, %147 : tensor<1x256x128xf32>
    %149 = stablehlo.transpose %arg5, dims = [1, 0] : (tensor<512x128xf32>) -> tensor<128x512xf32>
    %150 = stablehlo.reshape %148 : (tensor<1x256x128xf32>) -> tensor<256x128xf32>
    %151 = stablehlo.dot_general %150, %149, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x512xf32>) -> tensor<256x512xf32>
    %152 = stablehlo.reshape %151 : (tensor<256x512xf32>) -> tensor<1x256x512xf32>
    %153 = stablehlo.maximum %152, %cst_10 : tensor<1x256x512xf32>
    %154 = stablehlo.broadcast_in_dim %3, dims = [] : (tensor<f32>) -> tensor<1x256x512xf32>
    %155 = stablehlo.power %153, %154 : tensor<1x256x512xf32>
    %156 = stablehlo.transpose %arg6, dims = [1, 0] : (tensor<128x512xf32>) -> tensor<512x128xf32>
    %157 = stablehlo.reshape %155 : (tensor<1x256x512xf32>) -> tensor<256x512xf32>
    %158 = stablehlo.dot_general %157, %156, contracting_dims = [1] x [0] : (tensor<256x512xf32>, tensor<512x128xf32>) -> tensor<256x128xf32>
    %159 = stablehlo.reshape %158 : (tensor<256x128xf32>) -> tensor<1x256x128xf32>
    %160 = stablehlo.add %140, %159 : tensor<1x256x128xf32>
    %161 = stablehlo.power %160, %4 : tensor<1x256x128xf32>
    %162 = stablehlo.reduce(%161 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x256x128xf32>, tensor<f32>) -> tensor<1x256xf32>
    %163 = stablehlo.reshape %162 : (tensor<1x256xf32>) -> tensor<1x256x1xf32>
    %164 = stablehlo.divide %163, %10 : tensor<1x256x1xf32>
    %165 = stablehlo.add %164, %14 : tensor<1x256x1xf32>
    %166 = stablehlo.rsqrt %165 : tensor<1x256x1xf32>
    %167 = stablehlo.broadcast_in_dim %166, dims = [0, 1, 2] : (tensor<1x256x1xf32>) -> tensor<1x256x128xf32>
    %168 = stablehlo.multiply %160, %167 : tensor<1x256x128xf32>
    %169 = stablehlo.transpose %arg7, dims = [1, 0] : (tensor<128x128xf32>) -> tensor<128x128xf32>
    %170 = stablehlo.reshape %168 : (tensor<1x256x128xf32>) -> tensor<256x128xf32>
    %171 = stablehlo.dot_general %170, %169, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x128xf32>) -> tensor<256x128xf32>
    %172 = stablehlo.reshape %171 : (tensor<256x128xf32>) -> tensor<1x256x128xf32>
    %173 = stablehlo.reshape %172 : (tensor<1x256x128xf32>) -> tensor<1x256x4x32xf32>
    %174 = stablehlo.transpose %arg8, dims = [1, 0] : (tensor<128x128xf32>) -> tensor<128x128xf32>
    %175 = stablehlo.dot_general %170, %174, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x128xf32>) -> tensor<256x128xf32>
    %176 = stablehlo.reshape %175 : (tensor<256x128xf32>) -> tensor<1x256x128xf32>
    %177 = stablehlo.reshape %176 : (tensor<1x256x128xf32>) -> tensor<1x256x4x32xf32>
    %178 = stablehlo.transpose %arg9, dims = [1, 0] : (tensor<128x128xf32>) -> tensor<128x128xf32>
    %179 = stablehlo.dot_general %170, %178, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x128xf32>) -> tensor<256x128xf32>
    %180 = stablehlo.reshape %179 : (tensor<256x128xf32>) -> tensor<1x256x128xf32>
    %181 = stablehlo.reshape %180 : (tensor<1x256x128xf32>) -> tensor<1x256x4x32xf32>
    %182 = stablehlo.slice %173 [0:1, 0:256, 0:4, 0:16] : (tensor<1x256x4x32xf32>) -> tensor<1x256x4x16xf32>
    %183 = stablehlo.slice %173 [0:1, 0:256, 0:4, 16:32] : (tensor<1x256x4x32xf32>) -> tensor<1x256x4x16xf32>
    %184 = stablehlo.multiply %182, %43 : tensor<1x256x4x16xf32>
    %185 = stablehlo.multiply %183, %46 : tensor<1x256x4x16xf32>
    %186 = stablehlo.add %184, %185 : tensor<1x256x4x16xf32>
    %187 = stablehlo.multiply %182, %51 : tensor<1x256x4x16xf32>
    %188 = stablehlo.multiply %183, %43 : tensor<1x256x4x16xf32>
    %189 = stablehlo.add %187, %188 : tensor<1x256x4x16xf32>
    %190 = stablehlo.concatenate %186, %189, dim = 3 : (tensor<1x256x4x16xf32>, tensor<1x256x4x16xf32>) -> tensor<1x256x4x32xf32>
    %191 = stablehlo.slice %177 [0:1, 0:256, 0:4, 0:16] : (tensor<1x256x4x32xf32>) -> tensor<1x256x4x16xf32>
    %192 = stablehlo.slice %177 [0:1, 0:256, 0:4, 16:32] : (tensor<1x256x4x32xf32>) -> tensor<1x256x4x16xf32>
    %193 = stablehlo.multiply %191, %43 : tensor<1x256x4x16xf32>
    %194 = stablehlo.multiply %192, %46 : tensor<1x256x4x16xf32>
    %195 = stablehlo.add %193, %194 : tensor<1x256x4x16xf32>
    %196 = stablehlo.multiply %191, %51 : tensor<1x256x4x16xf32>
    %197 = stablehlo.multiply %192, %43 : tensor<1x256x4x16xf32>
    %198 = stablehlo.add %196, %197 : tensor<1x256x4x16xf32>
    %199 = stablehlo.concatenate %195, %198, dim = 3 : (tensor<1x256x4x16xf32>, tensor<1x256x4x16xf32>) -> tensor<1x256x4x32xf32>
    %200 = stablehlo.power %190, %65 : tensor<1x256x4x32xf32>
    %201 = stablehlo.reduce(%200 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x256x4x32xf32>, tensor<f32>) -> tensor<1x256x4xf32>
    %202 = stablehlo.reshape %201 : (tensor<1x256x4xf32>) -> tensor<1x256x4x1xf32>
    %203 = stablehlo.divide %202, %71 : tensor<1x256x4x1xf32>
    %204 = stablehlo.add %203, %73 : tensor<1x256x4x1xf32>
    %205 = stablehlo.rsqrt %204 : tensor<1x256x4x1xf32>
    %206 = stablehlo.broadcast_in_dim %205, dims = [0, 1, 2, 3] : (tensor<1x256x4x1xf32>) -> tensor<1x256x4x32xf32>
    %207 = stablehlo.multiply %190, %206 : tensor<1x256x4x32xf32>
    %208 = stablehlo.power %199, %65 : tensor<1x256x4x32xf32>
    %209 = stablehlo.reduce(%208 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x256x4x32xf32>, tensor<f32>) -> tensor<1x256x4xf32>
    %210 = stablehlo.reshape %209 : (tensor<1x256x4xf32>) -> tensor<1x256x4x1xf32>
    %211 = stablehlo.divide %210, %71 : tensor<1x256x4x1xf32>
    %212 = stablehlo.add %211, %73 : tensor<1x256x4x1xf32>
    %213 = stablehlo.rsqrt %212 : tensor<1x256x4x1xf32>
    %214 = stablehlo.broadcast_in_dim %213, dims = [0, 1, 2, 3] : (tensor<1x256x4x1xf32>) -> tensor<1x256x4x32xf32>
    %215 = stablehlo.multiply %199, %214 : tensor<1x256x4x32xf32>
    %216 = stablehlo.transpose %207, dims = [0, 2, 1, 3] : (tensor<1x256x4x32xf32>) -> tensor<1x4x256x32xf32>
    %217 = stablehlo.transpose %215, dims = [0, 2, 1, 3] : (tensor<1x256x4x32xf32>) -> tensor<1x4x256x32xf32>
    %218 = stablehlo.transpose %181, dims = [0, 2, 1, 3] : (tensor<1x256x4x32xf32>) -> tensor<1x4x256x32xf32>
    %219 = stablehlo.transpose %217, dims = [0, 1, 3, 2] : (tensor<1x4x256x32xf32>) -> tensor<1x4x32x256xf32>
    %220 = stablehlo.reshape %216 : (tensor<1x4x256x32xf32>) -> tensor<4x256x32xf32>
    %221 = stablehlo.reshape %219 : (tensor<1x4x32x256xf32>) -> tensor<4x32x256xf32>
    %222 = stablehlo.broadcast_in_dim %221, dims = [0, 1, 2] : (tensor<4x32x256xf32>) -> tensor<4x32x256xf32>
    %223 = stablehlo.dot_general %220, %222, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<4x256x32xf32>, tensor<4x32x256xf32>) -> tensor<4x256x256xf32>
    %224 = stablehlo.reshape %223 : (tensor<4x256x256xf32>) -> tensor<1x4x256x256xf32>
    %225 = stablehlo.multiply %224, %97 : tensor<1x4x256x256xf32>
    %226 = stablehlo.broadcast_in_dim %225, dims = [0, 1, 2, 3] : (tensor<1x4x256x256xf32>) -> tensor<1x4x256x256xf32>
    %227 = stablehlo.select %116, %117, %226 : tensor<1x4x256x256xi1>, tensor<1x4x256x256xf32>
    %228 = stablehlo.reduce(%227 init: %cst_6) applies stablehlo.maximum across dimensions = [3] : (tensor<1x4x256x256xf32>, tensor<f32>) -> tensor<1x4x256xf32>
    %229 = stablehlo.reshape %228 : (tensor<1x4x256xf32>) -> tensor<1x4x256x1xf32>
    %230 = stablehlo.broadcast_in_dim %229, dims = [0, 1, 2, 3] : (tensor<1x4x256x1xf32>) -> tensor<1x4x256x256xf32>
    %231 = stablehlo.subtract %227, %230 : tensor<1x4x256x256xf32>
    %232 = stablehlo.exponential %231 : tensor<1x4x256x256xf32>
    %233 = stablehlo.reduce(%232 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<1x4x256x256xf32>, tensor<f32>) -> tensor<1x4x256xf32>
    %234 = stablehlo.reshape %233 : (tensor<1x4x256xf32>) -> tensor<1x4x256x1xf32>
    %235 = stablehlo.broadcast_in_dim %234, dims = [0, 1, 2, 3] : (tensor<1x4x256x1xf32>) -> tensor<1x4x256x256xf32>
    %236 = stablehlo.divide %232, %235 : tensor<1x4x256x256xf32>
    %237 = stablehlo.reshape %236 : (tensor<1x4x256x256xf32>) -> tensor<4x256x256xf32>
    %238 = stablehlo.reshape %218 : (tensor<1x4x256x32xf32>) -> tensor<4x256x32xf32>
    %239 = stablehlo.broadcast_in_dim %238, dims = [0, 1, 2] : (tensor<4x256x32xf32>) -> tensor<4x256x32xf32>
    %240 = stablehlo.dot_general %237, %239, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<4x256x256xf32>, tensor<4x256x32xf32>) -> tensor<4x256x32xf32>
    %241 = stablehlo.reshape %240 : (tensor<4x256x32xf32>) -> tensor<1x4x256x32xf32>
    %242 = stablehlo.transpose %241, dims = [0, 2, 1, 3] : (tensor<1x4x256x32xf32>) -> tensor<1x256x4x32xf32>
    %243 = stablehlo.reshape %242 : (tensor<1x256x4x32xf32>) -> tensor<1x256x128xf32>
    %244 = stablehlo.transpose %arg10, dims = [1, 0] : (tensor<128x128xf32>) -> tensor<128x128xf32>
    %245 = stablehlo.reshape %243 : (tensor<1x256x128xf32>) -> tensor<256x128xf32>
    %246 = stablehlo.dot_general %245, %244, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x128xf32>) -> tensor<256x128xf32>
    %247 = stablehlo.reshape %246 : (tensor<256x128xf32>) -> tensor<1x256x128xf32>
    %248 = stablehlo.add %160, %247 : tensor<1x256x128xf32>
    %249 = stablehlo.power %248, %4 : tensor<1x256x128xf32>
    %250 = stablehlo.reduce(%249 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x256x128xf32>, tensor<f32>) -> tensor<1x256xf32>
    %251 = stablehlo.reshape %250 : (tensor<1x256xf32>) -> tensor<1x256x1xf32>
    %252 = stablehlo.divide %251, %10 : tensor<1x256x1xf32>
    %253 = stablehlo.add %252, %14 : tensor<1x256x1xf32>
    %254 = stablehlo.rsqrt %253 : tensor<1x256x1xf32>
    %255 = stablehlo.broadcast_in_dim %254, dims = [0, 1, 2] : (tensor<1x256x1xf32>) -> tensor<1x256x128xf32>
    %256 = stablehlo.multiply %248, %255 : tensor<1x256x128xf32>
    %257 = stablehlo.transpose %arg11, dims = [1, 0] : (tensor<512x128xf32>) -> tensor<128x512xf32>
    %258 = stablehlo.reshape %256 : (tensor<1x256x128xf32>) -> tensor<256x128xf32>
    %259 = stablehlo.dot_general %258, %257, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x512xf32>) -> tensor<256x512xf32>
    %260 = stablehlo.reshape %259 : (tensor<256x512xf32>) -> tensor<1x256x512xf32>
    %261 = stablehlo.maximum %260, %cst_10 : tensor<1x256x512xf32>
    %262 = stablehlo.power %261, %154 : tensor<1x256x512xf32>
    %263 = stablehlo.transpose %arg12, dims = [1, 0] : (tensor<128x512xf32>) -> tensor<512x128xf32>
    %264 = stablehlo.reshape %262 : (tensor<1x256x512xf32>) -> tensor<256x512xf32>
    %265 = stablehlo.dot_general %264, %263, contracting_dims = [1] x [0] : (tensor<256x512xf32>, tensor<512x128xf32>) -> tensor<256x128xf32>
    %266 = stablehlo.reshape %265 : (tensor<256x128xf32>) -> tensor<1x256x128xf32>
    %267 = stablehlo.add %248, %266 : tensor<1x256x128xf32>
    %268 = stablehlo.power %267, %4 : tensor<1x256x128xf32>
    %269 = stablehlo.reduce(%268 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<1x256x128xf32>, tensor<f32>) -> tensor<1x256xf32>
    %270 = stablehlo.reshape %269 : (tensor<1x256xf32>) -> tensor<1x256x1xf32>
    %271 = stablehlo.divide %270, %10 : tensor<1x256x1xf32>
    %272 = stablehlo.add %271, %14 : tensor<1x256x1xf32>
    %273 = stablehlo.rsqrt %272 : tensor<1x256x1xf32>
    %274 = stablehlo.broadcast_in_dim %273, dims = [0, 1, 2] : (tensor<1x256x1xf32>) -> tensor<1x256x128xf32>
    %275 = stablehlo.multiply %267, %274 : tensor<1x256x128xf32>
    %276 = stablehlo.transpose %arg13, dims = [1, 0] : (tensor<65536x128xf32>) -> tensor<128x65536xf32>
    %277 = stablehlo.reshape %275 : (tensor<1x256x128xf32>) -> tensor<256x128xf32>
    %278 = stablehlo.dot_general %277, %276, contracting_dims = [1] x [0] : (tensor<256x128xf32>, tensor<128x65536xf32>) -> tensor<256x65536xf32>
    %279 = stablehlo.reshape %278 : (tensor<256x65536xf32>) -> tensor<1x256x65536xf32>
    %280 = stablehlo.convert %cst_16 : (tensor<1xi64>) -> tensor<1xf32>
    %281 = stablehlo.reshape %280 : (tensor<1xf32>) -> tensor<f32>
    %282 = stablehlo.broadcast_in_dim %281, dims = [] : (tensor<f32>) -> tensor<1x256x65536xf32>
    %283 = stablehlo.divide %279, %282 : tensor<1x256x65536xf32>
    %284 = stablehlo.tanh %283 : tensor<1x256x65536xf32>
    %285 = stablehlo.multiply %284, %282 : tensor<1x256x65536xf32>
    %286 = stablehlo.reshape %285 : (tensor<1x256x65536xf32>) -> tensor<256x65536xf32>
    %287 = stablehlo.reshape %arg15 : (tensor<1x256xi64>) -> tensor<256xi64>
    %288 = stablehlo.reduce(%286 init: %cst_6) applies stablehlo.maximum across dimensions = [1] : (tensor<256x65536xf32>, tensor<f32>) -> tensor<256xf32>
    %289 = stablehlo.reshape %288 : (tensor<256xf32>) -> tensor<256x1xf32>
    %290 = stablehlo.broadcast_in_dim %289, dims = [0, 1] : (tensor<256x1xf32>) -> tensor<256x65536xf32>
    %291 = stablehlo.subtract %286, %290 : tensor<256x65536xf32>
    %292 = stablehlo.exponential %291 : tensor<256x65536xf32>
    %293 = stablehlo.reduce(%292 init: %cst) applies stablehlo.add across dimensions = [1] : (tensor<256x65536xf32>, tensor<f32>) -> tensor<256xf32>
    %294 = stablehlo.reshape %293 : (tensor<256xf32>) -> tensor<256x1xf32>
    %295 = stablehlo.log %294 : tensor<256x1xf32>
    %296 = stablehlo.broadcast_in_dim %295, dims = [0, 1] : (tensor<256x1xf32>) -> tensor<256x65536xf32>
    %297 = stablehlo.subtract %291, %296 : tensor<256x65536xf32>
    %298 = stablehlo.compare  NE, %287, %c,  SIGNED : (tensor<256xi64>, tensor<256xi64>) -> tensor<256xi1>
    %299 = stablehlo.broadcast_in_dim %298, dims = [0] : (tensor<256xi1>) -> tensor<256xi1>
    %300 = stablehlo.broadcast_in_dim %287, dims = [0] : (tensor<256xi64>) -> tensor<256xi64>
    %301 = stablehlo.select %299, %300, %c_1 : tensor<256xi1>, tensor<256xi64>
    %302 = stablehlo.reshape %301 : (tensor<256xi64>) -> tensor<256x1xi64>
    %303 = stablehlo.iota dim = 0 : tensor<256x1x1xi64>
    %304 = stablehlo.reshape %302 : (tensor<256x1xi64>) -> tensor<256x1x1xi64>
    %305 = stablehlo.concatenate %303, %304, dim = 2 : (tensor<256x1x1xi64>, tensor<256x1x1xi64>) -> tensor<256x1x2xi64>
    %306 = "stablehlo.gather"(%297, %305) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0, 1], start_index_map = [0, 1], index_vector_dim = 2>, slice_sizes = array<i64: 1, 1>}> : (tensor<256x65536xf32>, tensor<256x1x2xi64>) -> tensor<256x1xf32>
    %307 = stablehlo.reshape %306 : (tensor<256x1xf32>) -> tensor<256xf32>
    %308 = stablehlo.negate %307 : tensor<256xf32>
    %309 = stablehlo.broadcast_in_dim %308, dims = [0] : (tensor<256xf32>) -> tensor<256xf32>
    %310 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<256xf32>
    %311 = stablehlo.select %299, %309, %310 : tensor<256xi1>, tensor<256xf32>
    %312 = stablehlo.convert %298 : (tensor<256xi1>) -> tensor<256xi64>
    %313 = stablehlo.reduce(%312 init: %c_5) applies stablehlo.add across dimensions = [0] : (tensor<256xi64>, tensor<i64>) -> tensor<i64>
    %314 = stablehlo.convert %313 : (tensor<i64>) -> tensor<f32>
    %315 = stablehlo.reduce(%311 init: %cst) applies stablehlo.add across dimensions = [0] : (tensor<256xf32>, tensor<f32>) -> tensor<f32>
    %316 = stablehlo.divide %315, %314 : tensor<f32>
    return %316 : tensor<f32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_1_256_1_16_torch.bfloat16_1: "0x020000000000000000000000000000000000000000000000000000000000000000000000573F083F9F3E353ECC3D663D023D923C243CB83B4F3BE93A833A133AA6393A39693F673F173FB23E4B3EE63D813D123DA43C383CCF3B693B033B933A263ABA39113E7E3F503F023F973E2C3EC23D5A3DF63C8A3C1B3CAF3B453BDD3A793A0C3A42BF473F743F273FC73E643E013E923D243DB83C4F3CE93B833B133BA63A3A3A75BFA63E803F473FF53E8E3E213EB63D4D3DE63C823C123CA43B383BCF3A693A8FBE6CBE723F603F113FA93E413EDA3D763D0A3D9B3C2F3CC53B5D3BF93A8C3A283F37BF4D3F733F253FC43E613EFE3D8F3D213DB53C4C3CE53B813B113BA33A7D3F7ABF133F7D3F383FDF3E803E113EA43D383DCF3C693C033C933B263BBA3AD33E71BF953E803F493FF83E903E233EB83D4F3DE93C833C133CA63B3B3BD23A0BBF1DBFA9BC7B3F573F083F9F3E353ECC3D663D023D923C243CB83B4F3BE93A80BFC7BDA9BE6D3F643F143FAF3E473EE13D7D3D0E3DA03C343CCB3B643B003B09BFE63E1CBF583F6F3F203FBE3E593EF53D8A3D1B3DAF3C453CDD3B793B0C3BD73E5B3F53BF3D3F773F2B3FCD3E6B3E053E963D283DBD3C553CF03B873B183B7E3F803F76BF1B3F7C3F353FDB3E7C3E0F3EA13D353DCC3C653C013C913B233B263F563F80BFEA3E7F3F3F3FEA3E873E193EAD3D423DDA3C763C0A3C9B3B2F3B93BED43E71BF963E803F483FF83E903E233EB83D4F3DE93C833C133CA63B3A3B76BF0ABE4ABFF23D7E3F513F033F983E2D3EC33D5C3DF83C8B3C1D3CB03B463B40BF24BF0FBF73BD793F593F0A3FA13E373ECF3D693D033D933C263CBB3B523B193E74BF8BBE71BE723F603F113FAA3E413EDA3D763D0A3D9C3C2F3CC53B5D3B6A3F78BF293DCEBE693F673F173FB23E4B3EE63D813D123DA43C383CCF3B693B563F30BFB33E0FBF5D3F6D3F1E3FBB3E553EF13D883D193DAC3C413CDA3B753B11BC46BE203F32BF4F3F723F243FC33E5F3EFD3D8E3D203DB43C4B3CE43B803B59BFB83E563F50BF3F3F763F2A3FCC3E693E043E953D273DBC3C543CEE3B863B68BF4D3F773F67BF2D3F7A3F303FD43E733E0A3E9B3D2F3DC53C5D3CF93B8C3B08BE7F3F803F77BF193F7D3F363FDC3E7D3E0F3EA23D363DCD3C663C023C923B433F633F6F3F7FBF043F7E3F3C3FE43E843E153EA83D3D3DD53C703C073C983B753F003F463F7FBFDB3E803F413FEC3E893E1B3EAF3D453DDD3C793C0C3C9D3B8B3E1ABD0A3F77BFAC3E803F463FF53E8D3E213EB53D4C3DE53C813C113CA33B2ABF11BF813E67BF753E803F4B3FFC3E923E263EBC3D533DEE3C863C163CA93B7DBF6BBF7EBD50BF113E7E3F503F023F973E2C3EC23D5A3DF63C8A3C1B3CAF3BCFBE7DBFBDBE32BF2A3D7C3F553F063F9C3E323EC83D623DFE3C8F3C213CB53B0D3F41BF24BF0FBF6FBD793F593F0A3FA13E373ECF3D693D033D933C263CBA3B803F94BE59BFCEBE22BE763F5D3F0E3FA63E3D3ED53D703D073D983C2B3CC03B073F893E78BF70BE83BE713F613F123FAB3E433EDC3D773D0B3D9D3C303CC63BDBBE3D3F7FBF72BDB4BE6C3F653F153FB03E483EE23D7F3D0F3DA13C353CCC3B7EBF7C3F6DBFF23DE3BE663F683F193FB43E4E3EE93D833D133DA63C3B3CD23B25BF6D3F43BF963E08BF5F3F6C3F1D3FB93E543EEF3D873D183DAA3C403CD83B983E153F06BFEA3E1DBF583F6F3F203FBE3E593EF63D8A3D1C3DAF3C453CDD3B773F753D6DBE1B3F30BF503F723F243FC33E5F3EFC3D8E3D203DB43C4A3CE33B3F3FF7BEA93D3D3F42BF473F743F273FC73E643E013E923D243DB83C4F3CE93B22BE60BFC73E583F51BF3E3F763F2B3FCC3E6A3E043E953D283DBD3C543CEF3B6BBF80BF283F6D3F5FBF343F793F2E3FD13E703E083E993D2C3DC13C5A3CF53B55BF51BF5C3F7B3F6BBF293F7A3F313FD53E753E0B3E9C3D303DC63C5F3CFB3B913CC3BE7A3F803F74BF1E3F7C3F343FDA3E7B3E0E3EA03D343DCB3C643C003C5A3F303E7F3F7D3F7ABF133F7D3F383FDF3E803E113EA43D383DCF3C693C033C673F2C3F6B3F733F7EBF073F7E3F3B3FE33E833E143EA73D3C3DD43C6E3C063CFD3D763F403F603F80BFF53E7F3F3E3FE83E863E183EAB3D403DD83C743C093C45BF753F013F473F7FBFDB3E803F413FEC3E893E1B3EAF3D453DDD3C793C0C3C74BF293F583E273F7CBFC13E803F443FF13E8B3E1E3EB23D493DE23C7E3C0F3C86BE203ED3BD023F75BFA63E803F473FF53E8E3E213EB63D4D3DE63C823C123C2C3FCABED1BEB23E6DBF8A3E803F4A3FFA3E913E243EB93D513DEB3C843C153C7D3F53BF2CBF353E62BF5D3E7F3F4C3FFE3E943E283EBD3D553DF03C873C183CCB3E80BF5EBFD8B855BF243E7F3F4F3F013F963E2B3EC13D593DF43C893C1A3C0FBF5EBF7BBF35BE46BFD73D7E3F523F043F993E2E3EC43D5D3DF93C8C3C1D3C80BFF0BE7EBFB2BE35BF473D7C3F543F063F9C3E313EC83D613DFD3C8E3C203C06BF9A3D69BF02BF22BFF6BB7B3F573F083F9F3E343ECC3D653D013D913C233CDF3E183F3CBF27BF0DBF82BD793F593F0A3FA13E383ECF3D693D033D943C263C7E3F6F3FF9BE47BFEEBEF5BD773F5C3F0C3FA43E3B3ED33D6D3D063D963C293C233F7B3F44BE60BFBFBE34BE753F5E3F0E3FA73E3E3ED63D723D083D993C2C3C9CBE3B3FFE3D73BF8FBE6CBE723F603F113FA93E413EDA3D763D0A3D9B3C2F3C77BF813EDA3E7DBF3BBE92BE703F623F133FAC3E443EDE3D7A3D0C3D9E3C323C3DBF9BBE303F80BFAABDADBE6D3F643F153FAF3E473EE13D7E3D0F3DA13C353C2B3E44BF613F7BBF8A3CC8BE6A3F663F173FB23E4B3EE53D813D113DA33C383C6C3F7EBF7C3F6DBFEF3DE2BE663F683F193FB43E4E3EE93D833D133DA63C3A3C543F69BF7E3F58BF5C3EFCBE633F6A3F1B3FB73E513EEC3D853D163DA83C3D3CDABC0DBF663F3DBFA03E0ABF5F3F6C3F1D3FBA3E543EF03D873D183DAB3C403C5BBFB6BC383F1BBFCF3E16BF5B3F6E3F1F3FBC3E573EF33D893D1A3DAE3C433C66BF043FF03EEABEFD3E21BF563F6F3F213FBF3E5B3EF73D8B3D1D3DB03C463CEBBD643F2F3E95BE143F2CBF523F713F233FC23E5E3EFB3D8D3D1F3DB33C493C463F7F3F14BEF2BD283F37BF4D3F733F253FC43E613EFE3D8F3D213DB53C4C3C733F4B3FE4BE733D3B3F41BF483F743F273FC73E643E013E913D233DB83C4F3C823EB13E34BF713E4B3F4ABF433F753F293FCA3E673E033E933D263DBB3C523C2DBF56BE63BFCE3E5A3F52BF3D3F773F2B3FCC3E6A3E053E953D283DBD3C553C7CBF33BF7DBF0F3F663F5ABF383F783F2D3FCF3E6D3E063E973D2A3DC03C583CC7BE79BF7DBF323F703F61BF323F793F2E3FD23E713E083E993D2D3DC23C5B3C113F72BF64BF503F783F68BF2C3F7A3F303FD43E743E0A3E9B3D2F3DC53C5D3C803F21BF35BF673F7D3F6EBF263F7B3F323FD73E773E0C3E9E3D313DC73C603C043FF5BDE6BE773F803F73BF203F7C3F343FD93E7A3E0E3EA03D343DCA3C633CE3BEDB3E1ABE7F3F803F77BF1A3F7C3F363FDC3E7D3E0F3EA23D363DCD3C663C7EBF583F293E7F3F7D3F7ABF133F7D3F383FDF3E803E113EA43D383DCF3C693C21BF803FED3E773F783F7DBF0C3F7E3F393FE13E823E133EA63D3B3DD23C6C3CA03E593F373F673F713F7FBF053F7E3F3B3FE43E833E153EA83D3D3DD43C6F3C783FDE3E663F503F673F80BFFD3E7F3F3D3FE63E853E173EAA3D3F3DD73C723C3C3FE6BD7D3F323F5B3F80BFEF3E7F3F3F3FE93E863E183EAC3D413DDA3C753C34BE20BF7C3F0F3F4C3F7FBFE03E803F403FEC3E883E1A3EAE3D443DDC3C783C6CBF72BF623FCE3E3C3F7EBFD23E803F423FEE3E8A3E1C3EB03D463DDF3C7B3C52BF79BF313F703E2A3F7CBFC33E803F443FF13E8B3E1E3EB23D483DE13C7D3C113D34BFDD3E723D163F79BFB43E803F453FF33E8D3E203EB43D4B3DE43C803C5C3F5DBE053EF3BD003F75BFA53E803F473FF63E8E3E213EB63D4D3DE73C823C653FAD3E3EBE96BED33E71BF953E803F493FF83E903E233EB83D4F3DE93C833CD93D4A3FF7BEEABEA33E6BBF863E803F4A3FFB3E913E253EBA3D523DEC3C853C48BF7F3F3BBF1BBF643E65BF6C3E7F3F4C3FFD3E933E273EBC3D543DEE3C863C73BF653F68BF3DBFFF3D5EBF4C3E7F3F4D3F003F943E293EBE3D563DF13C873C7BBE053F7EBF58BFCB3C57BF2C3E7F3F4F3F013F963E2A3EC03D583DF33C893C2F3F7CBC7BBF6DBF9ABD4FBF0C3E7E3F503F023F983E2C3EC23D5B3DF63C8A3C7C3F0CBF5FBF7BBF33BE46BFD83D7E3F523F043F993E2E3EC43D5D3DF93C8C3CC23E69BF2DBF80BF8BBE3DBF983D7D3F533F053F9B3E303EC63D5F3DFB3C8D3C13BF7EBFD3BE7DBFBCBE33BF2E3D7C3F553F063F9C3E323EC83D623DFE3C8F3C80BF45BFE0BD72BFEABE28BF333C7B3F563F073F9E3E333ECA3D643D003D903C02BF9EBE523E60BF0BBF1DBFA9BC7B3F573F083F9F3E353ECC3D663D023D923CE73E7B3E003F47BF20BF11BF56BD7A3F593F0A3FA13E373ECE3D693D033D933C7F3F393F3F3F27BF33BF05BFACBD783F5A3F0B3FA23E393ED13D6B3D043D953C1F3F7B3F6A3F02BF45BFF1BEECBD773F5B3F0C3FA43E3B3ED33D6D3D053D963CA5BE6F3F7F3FB2BE54BFD8BE16BE763F5D3F0D3FA53E3C3ED53D6F3D073D973C78BF1A3F7A3F35BE61BFBDBE36BE753F5E3F0F3FA73E3E3ED73D723D083D993C3ABFA83D5C3F58396CBFA2BE56BE733F5F3F103FA83E403ED93D743D093D9A3C3D3EEDBE293F353E75BF87BE75BE723F613F113FAA3E423EDB3D763D0B3D9C3C6D3F5DBFCA3EB23E7BBF55BE8ABE713F623F123FAB3E433EDD3D793D0C3D9D3C513F80BFB53D023F7FBF1DBE9ABE6F3F633F133FAD3E453EDF3D7B3D0D3D9F3C35BD54BF67BE273F80BFC7BDA9BE6D3F643F143FAF3E473EE13D7D3D0E3DA03C5DBFCDBE04BF473F7FBF29BDB8BE6B3F653F163FB03E493EE33D803D103DA23C64BF193E42BF603F7BBF763CC7BE6A3F663F173FB23E4B3EE53D813D113DA33CC7BD273F6CBF733F74BF923DD6BE683F683F183FB33E4C3EE73D823D123DA53C493F753F7FBF7D3F6BBF023EE5BE663F693F193FB53E4E3EE93D833D143DA63C723F773F79BF803F60BF3B3EF3BE643F6A3F1A3FB63E503EEB3D843D153DA83C723E2D3F5ABF7A3F53BF733E01BF623F6B3F1B3FB83E523EED3D853D163DA93C31BF373E25BF6D3F43BF953E08BF5F3F6C3F1D3FB93E543EEF3D873D183DAA3C7BBFBFBEC0BE583F32BFB13E0EBF5D3F6D3F1E3FBB3E553EF13D883D193DAC3CBEBE50BF8BBD3D3F1EBFCB3E15BF5B3F6E3F1F3FBC3E573EF33D893D1A3DAD3C153F7FBF7C3E1B3F09BFE63E1CBF583F6F3F203FBE3E593EF53D8A3D1B3DAF3C803F61BF093FEA3EE6BEFF3E22BF563F703F213FBF3E5B3EF73D8B3D1D3DB03CFF3EFABE453F953EB7BE0C3F28BF533F703F223FC13E5C3EF93D8C3D1E3DB23CEBBE593D6E3FF23D87BE183F2EBF513F713F233FC23E5E3EFB3D8E3D1F3DB33C7FBF143F803F74BD2ABE233F34BF4E3F723F243FC43E603EFD3D8F3D213DB53C1EBF6C3F773F71BE88BD2E3F3ABF4B3F733F253FC53E623EFF3D903D223DB63CA93E7C3F573FCFBE0A3D383F3FBF493F743F273FC73E643E013E913D233DB83C793F3F3F213F0FBF083E423F44BF463F753F283FC83E653E023E923D243DB93C393F8C3EB63E32BF6D3E4B3F4ABF433F753F293FCA3E673E033E933D263DBA3C46BE90BE423D50BFA83E533F4EBF403F763F2A3FCB3E693E043E943D273DBC3C6EBF40BF88BE67BFD73E5B3F53BF3D3F773F2B3FCD3E6B3E053E963D283DBD3C50BF7DBF0DBF77BF023F623F58BF3A3F773F2C3FCE3E6C3E063E973D2A3DBF3C593D6CBF49BF7FBF183F693F5CBF373F783F2D3FD03E6E3E073E983D2B3DC03C5E3F12BF70BF7FBF2B3F6E3F60BF333F793F2E3FD13E703E083E993D2C3DC23C633F36BD80BF77BF3E3F733F64BF303F793F2F3FD33E723E093E9A3D2E3DC33CB53DFD3E76BF67BF4E3F773F67BF2D3F7A3F303FD43E733E0A3E9B3D2F3DC53C4ABF623F54BF50BF5C3F7B3F6BBF293F7A3F313FD53E753E0B3E9C3D303DC63C71BF7F3F1DBF32BF683F7D3F6EBF263F7B3F323FD73E773E0C3E9E3D313DC83C6ABE4E3FACBE0FBF723F7F3F71BF223F7B3F333FD83E793E0D3E9F3D333DC93C323FBB3EDABCCEBE793F803F73BF1F3F7C3F343FDA3E7B3E0E3EA03D343DCA3C7B3F3FBE923E70BE7E3F803F76BF1B3F7C3F353FDB3E7C3E0F3EA13D353DCC3CBA3E2FBF123F72BD803F7F3F78BF183F7D3F363FDD3E7E3E103EA23D373DCD3C16BF78BF4C3FF33D7F3F7E3F7ABF143F7D3F373FDE3E803E113EA33D383DCF3C80BF74BF723F963E7D3F7C3F7BBF103F7D3F383FE03E813E123EA53D393DD03CFBBE26BF803FEA3E773F783F7DBF0C3F7E3F393FE13E823E133EA63D3A3DD23CEF3E11BE753F1B3F6F3F753F7EBF093F7E3F3A3FE33E833E143EA73D3C3DD33C7F3FD13E513F3D3F653F703F7FBF053F7E3F3B3FE43E833E153EA83D3D3DD53C1C3F553F193F593F593F6B3F7FBF013F7F3F3C3FE63E843E163EA93D3E3DD63CADBE803FA23E6D3F4A3F643F80BFFA3E7F3F3D3FE73E853E173EAA3D403DD83C7ABF5C3FC33B7B3F393F5E3F80BFF23E7F3F3E3FE83E863E183EAB3D413DD93C37BFE93E9CBE803F263F563F80BFEA3E7F3F3F3FEA3E873E193EAD3D423DDA3C4F3EB9BD16BF7D3F123F4E3F7FBFE23E803F403FEB3E883E1A3EAE3D443DDC3C6F3F1CBF4FBF723FF93E453F7FBFD93E803F413FED3E893E1B3EAF3D453DDD3C4E3F70BF74BF603FCB3E3B3F7EBFD13E803F423FEE3E8A3E1C3EB03D463DDF3C7EBD7BBF80BF473F9B3E313F7DBFC93E803F433FF03E8A3E1D3EB13D473DE03C60BF38BF73BF273F533E273F7BBFC03E803F443FF13E8B3E1E3EB23D493DE23C62BF73BE4EBF023FDD3D1B3F7ABFB83E803F453FF23E8C3E1F3EB33D4A3DE33CA3BDA33E14BFB23E023C103F78BFAF3E803F463FF43E8D3E203EB53D4B3DE53C4C3F463F98BE353EBCBD043F76BFA73E803F473FF53E8E3E213EB63D4D3DE63C713F7E3F713CA2B943BEEE3E73BF9E3E803F483FF73E8F3E223EB73D4E3DE83C613E683FA63E35BE93BED43E71BF963E803F483FF83E903E233EB83D4F3DE93C34BF0A3F1A3FB2BEC4BEBA3E6EBF8D3E803F493FFA3E913E243EB93D503DEB3C7ABFE23B523F02BFF2BE9F3E6BBF843E803F4A3FFB3E913E253EBA3D523DEC3CB6BE07BF753F27BF0FBF833E67BF763E803F4B3FFC3E923E263EBB3D533DED3C183F66BF803F47BF23BF4E3E64BF653E7F3F4C3FFE3E933E273EBD3D543DEF3C7F3F7EBF713F60BF36BF153E60BF533E7F3F4D3FFF3E943E283EBE3D563DF03CF73E48BF4B3F73BF47BFB83D5CBF413E7F3F4E3F003F953E293EBF3D573DF23CF3BEA9BE103F7DBF56BF0A3D58BF2F3E7F3F4F3F013F963E2A3EC03D583DF33C7FBF653E8E3E80BF63BFB9BC53BF1D3E7E3F4F3F023F973E2B3EC13D5A3DF53C1ABF353F11BD7ABF6EBFA1BD4FBF0B3E7E3F503F023F983E2C3EC23D5B3DF63CB13E7A3FB0BE6DBF76BF0ABE4ABFF23D7E3F513F033F983E2D3EC33D5C3DF83C7A3F713F1FBF58BF7CBF43BE45BFCE3D7E3F523F043F993E2E3EC53D5D3DF93C353F1E3F55BF3DBF7FBF7BBE3FBFAA3D7D3F533F043F9A3E2F3EC63D5F3DFB3C58BED53D77BF1BBF80BF99BE3ABF853D7D3F543F053F9B3E303EC73D603DFC3C70BFE2BE80BFEABE7EBFB4BE34BF423D7C3F543F063F9C3E313EC83D613DFD3C4DBF5ABF6FBF95BE7ABFCFBE2EBFF23C7C3F553F073F9D3E323EC93D633DFF3C913D80BF47BFF2BD73BFE9BE28BF423C7B3F563F073F9E3E333ECA3D643D003D613F57BF0CBF743D6ABF01BF22BFC3BB7B3F573F083F9F3E343ECC3D653D013D613FD7BE84BE713E5EBF0DBF1CBFC2BC7A3F583F093F9F3E353ECD3D663D023D913D033E663DCF3E50BF19BF15BF2ABD7A3F583F093FA03E363ECE3D683D023D4DBF233FBA3E0F3F40BF24BF0FBF73BD793F593F0A3FA13E373ECF3D693D033D70BF733F233F323F2EBF2FBF08BF9EBD793F5A3F0B3FA23E383ED03D6A3D043D58BE783F583F503F1BBF39BF01BFC2BD783F5B3F0B3FA33E393ED13D6C3D053D353F313F783F673F06BF43BFF4BEE6BD773F5B3F0C3FA43E3A3ED23D6D3D053D7A3F4D3E7F3F773FDEBE4CBFE5BE05BE773F5C3F0D3FA53E3B3ED43D6E3D063DB13EB5BE6D3F7F3FAFBE54BFD7BE17BE763F5D3F0D3FA53E3C3ED53D6F3D073D1ABF4CBF443F7F3F7DBE5CBFC8BE29BE753F5E3F0E3FA63E3D3ED63D713D073D7FBF7FBF073F773F19BE63BFB9BE3BBE753F5E3F0F3FA73E3E3ED73D723D083DF3BE63BF733E673F4BBD69BFAABE4DBE743F5F3F0F3FA83E3F3ED83D733D093DF73E02BF9DBD503F4F3D6FBF9ABE5FBE733F603F103FA93E403ED93D753D0A3D7F3FFC3CC4BE323F193E74BF8BBE71BE723F603F113FAA3E413EDA3D763D0A3D183F0F3F27BF0F3F7E3E78BF77BE81BE713F613F113FAB3E423EDC3D773D0B3DB6BE6A3F5BBFCE3EB03E7BBF57BE8ABE713F623F123FAB3E433EDD3D793D0C3D7ABF7D3F79BF703EDF3E7DBF37BE93BE703F623F133FAC3E443EDE3D7A3D0D3D34BF423F7FBF713D063F7FBF17BE9BBE6F3F633F133FAD3E453EDF3D7B3D0D3D613E973E6BBFF3BD1B3F80BFEFBDA4BE6E3F643F143FAE3E463EE03D7C3D0E3D713F85BE41BF96BE2F3F80BFAEBDADBE6D3F643F153FAF3E473EE13D7E3D0F3D4C3F3CBF03BFEABE403F7FBF5BBDB5BE6C3F653F153FB03E483EE23D7F3D0F3DA3BD7CBF5EBE1BBF503F7EBFB3BCBEBE6B3F663F163FB13E493EE43D803D103D62BF6EBFC73D3DBF5E3F7BBF203CC6BE6A3F663F173FB13E4A3EE53D813D113D60BF17BFCE3E59BF6A3F78BF293DCEBE693F673F173FB23E4B3EE63D813D123D7EBD89BD2B3F6DBF733F74BF953DD7BE683F683F183FB33E4C3EE73D823D123D4E3FF33E5E3F7BBF7A3F6FBFD63DDFBE673F683F193FB43E4D3EE83D833D133D6F3F5F3F7A3F80BF7E3F6ABF0B3EE7BE653F693F193FB53E4E3EE93D833D143D4F3E803F7F3F7DBF803F64BF2B3EEFBE643F693F1A3FB63E4F3EEA3D843D153D37BF523F693F72BF7F3F5DBF4B3EF7BE633F6A3F1B3FB73E503EEC3D853D153D7ABFC63E3D3F60BF7C3F55BF6B3EFFBE623F6B3F1B3FB73E513EED3D853D163DADBE29BEFC3E47BF763F4DBF853E03BF613F6B3F1C3FB83E523EEE3D863D173D1C3F2ABF4A3E27BF6E3F44BF953E07BF603F6C3F1D3FB93E533EEF3D873D173D7F3F76BFF1BD02BF633F3ABFA43E0BBF5E3F6C3F1D3FBA3E543EF03D873D183DEF3E76BFD7BEB2BE563F30BFB33E0FBF5D3F6D3F1E3FBB3E553EF13D883D193DFBBE2ABF2FBF35BE473F25BFC23E13BF5C3F6D3F1E3FBC3E563EF23D893D1A3D80BF27BE60BFD839363F1ABFD13E16BF5A3F6E3F1F3FBC3E573EF43D893D1A3D16BFC73E7CBF363E233F0EBFE03E1ABF593F6E3F203FBD3E583EF53D8A3D1B3DBA3E523F7EBFB23E0F3F02BFEE3E1EBF583F6F3F203FBE3E593EF63D8A3D1C3D7B3F803F67BF023FF13EEBBEFC3E21BF563F6F3F213FBF3E5A3EF73D8B3D1D3D323F5F3F39BF273FC33ED1BE053F25BF553F703F223FC03E5B3EF83D8C3D1D3D6ABEF33EF3BE473F933EB6BE0C3F28BF533F703F223FC13E5C3EF93D8C3D1E3D71BF8CBD35BE603F433E9BBE133F2CBF523F713F233FC23E5D3EFA3D8D3D1F3D4ABF17BF0E3E733FBA3D7EBE193F2FBF503F713F233FC23E5E3EFC3D8E3D1F3DB53D6EBFE13E7D3F11BC46BE203F32BF4F3F723F243FC33E5F3EFD3D8E3D203D633F7CBF323F803FDEBD0EBE263F36BF4D3F723F253FC43E603EFE3D8F3D213D5E3F3CBF633F7A3F54BEA9BD2C3F39BF4C3F733F253FC53E613EFF3D903D223D593D84BE7C3F6D3F9CBED6BC323F3CBF4A3F733F263FC63E623E003E903D223D50BF983E7D3F583FCCBEF63C383F3FBF493F743F273FC73E633E013E913D233D6EBF433F653F3D3FF9BEB13D3D3F42BF473F743F273FC73E643E013E923D243D46BE7D3F363F1B3F12BF113E433F45BF463F753F283FC83E653E023E923D253D393F6A3FE93EEA3E27BF4A3E483F48BF443F753F283FC93E663E023E933D253D793F0F3F203E953E39BF813E4D3F4BBF423F753F293FCA3E673E033E943D263DA93EEF3C23BEF13D4ABF9D3E513F4DBF413F763F2A3FCB3E683E043E943D273D1EBF02BFEABE74BD59BFB83E563F50BF3F3F763F2A3FCC3E693E043E953D273D7FBF64BF36BF71BE65BFD33E5A3F53BF3D3F773F2B3FCC3E6A3E053E953D283DEBBE7FBF65BFCFBE6FBFEC3E5E3F55BF3B3F773F2B3FCD3E6B3E053E963D293DFF3E4CBF7DBF0FBF77BF033F623F58BF3A3F773F2C3FCE3E6C3E063E973D2A3D803FB4BE7CBF32BF7DBF0F3F663F5ABF383F783F2D3FCF3E6D3E063E973D2A3D153F4F3E62BF50BF80BF1B3F693F5CBF363F783F2D3FD03E6E3E073E983D2B3DBEBE313F32BF67BF80BF263F6D3F5FBF343F783F2E3FD13E6F3E073E993D2C3D7BBF783FE0BE77BF7EBF313F703F61BF333F793F2E3FD13E703E083E993D2D3D31BF733F0BBE7FBF79BF3B3F723F63BF313F793F2F3FD23E713E093E9A3D2D3D723E233F383E7FBF72BF443F753F65BF2F3F793F303FD33E723E093E9B3D2E3D723F013EF43E77BF68BF4D3F773F67BF2D3F7A3F303FD43E733E0A3E9B3D2F3D493FD8BE3A3F67BF5CBF553F793F69BF2B3F7A3F313FD53E743E0A3E9C3D2F3DC7BD57BF673F50BF4EBF5D3F7B3F6BBF293F7A3F313FD63E753E0B3E9D3D303D64BF80BF7E3F32BF3DBF643F7C3F6DBF273F7B3F323FD63E763E0B3E9D3D313D5DBF5ABF7B3F0FBF2BBF6A3F7E3F6EBF253F7B3F333FD73E773E0C3E9E3D323D35BDE2BE603FCEBE17BF703F7F3F70BF233F7B3F333FD83E783E0D3E9F3D323D513FD83D2E3F70BE02BF743F7F3F72BF213F7C3F343FD93E793E0D3E9F3D333D6D3F1F3FD63E71BDD7BE783F803F73BF1F3F7C3F343FDA3E7A3E0E3EA03D343D3D3E713FEC3DF33DA7BE7B3F803F74BF1D3F7C3F353FDB3E7B3E0E3EA03D353D3ABF7A3F4CBE963E6CBE7E3F803F76BF1B3F7C3F353FDB3E7C3E0F3EA13D353D78BF353FFDBEEA3E08BE7F3F803F77BF193F7D3F363FDC3E7D3E0F3EA23D363DA5BE633E3DBF1B3F06BD803F7F3F78BF173F7D3F373FDD3E7E3E103EA23D373D1F3FAABE6ABF3D3F8A3D803F7E3F79BF153F7D3F373FDE3E7F3E113EA33D373D7F3F49BF7FBF593F2A3E7F3F7D3F7ABF133F7D3F383FDF3E803E113EA43D383DE73E7FBF7ABF6D3F873E7D3F7C3F7BBF113F7D3F383FDF3E813E123EA43D393D02BF66BF5DBF7B3FB83E7B3F7A3F7CBF0F3F7E3F393FE03E813E123EA53D3A3D",
