module {
  func.func @main(%arg0: tensor<65536x256xbf16>, %arg1: tensor<256x256xbf16>, %arg2: tensor<128x256xbf16>, %arg3: tensor<128x256xbf16>, %arg4: tensor<256x256xbf16>, %arg5: tensor<1024x256xbf16>, %arg6: tensor<256x1024xbf16>, %arg7: tensor<256x256xbf16>, %arg8: tensor<128x256xbf16>, %arg9: tensor<128x256xbf16>, %arg10: tensor<256x256xbf16>, %arg11: tensor<1024x256xbf16>, %arg12: tensor<256x1024xbf16>, %arg13: tensor<256x256xbf16>, %arg14: tensor<128x256xbf16>, %arg15: tensor<128x256xbf16>, %arg16: tensor<256x256xbf16>, %arg17: tensor<1024x256xbf16>, %arg18: tensor<256x1024xbf16>, %arg19: tensor<256x256xbf16>, %arg20: tensor<128x256xbf16>, %arg21: tensor<128x256xbf16>, %arg22: tensor<256x256xbf16>, %arg23: tensor<1024x256xbf16>, %arg24: tensor<256x1024xbf16>, %arg25: tensor<65536x256xbf16>, %arg26: tensor<4x2048xi64>, %arg27: tensor<4x2048xi64>) -> tensor<f32> {
    %c = stablehlo.constant dense<0> : tensor<8192xi64>
    %c_0 = stablehlo.constant dense<-1> : tensor<8192xi64>
    %c_1 = stablehlo.constant dense<1> : tensor<2048x2048xi64>
    %c_2 = stablehlo.constant dense<0> : tensor<2048xi64>
    %c_3 = stablehlo.constant dense<1> : tensor<2048xi64>
    %c_4 = stablehlo.constant dense<2048> : tensor<i64>
    %c_5 = stablehlo.constant dense<1> : tensor<i64>
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %c_6 = stablehlo.constant dense<0> : tensor<i64>
    %cst_7 = stablehlo.constant dense<-6.553600e+04> : tensor<bf16>
    %c_8 = stablehlo.constant dense<true> : tensor<2048x2048xi1>
    %cst_9 = stablehlo.constant dense_resource<torch_tensor_1_2048_1_16_torch.bfloat16_1> : tensor<1x2048x1x16xbf16>
    %cst_10 = stablehlo.constant dense_resource<torch_tensor_1_2048_1_16_torch.bfloat16> : tensor<1x2048x1x16xbf16>
    %cst_11 = stablehlo.constant dense<0xFF800000> : tensor<f32>
    %cst_12 = stablehlo.constant dense<0.000000e+00> : tensor<4x2048x1024xbf16>
    %cst_13 = arith.constant dense<2> : tensor<1xi64>
    %cst_14 = arith.constant dense<256> : tensor<1xi64>
    %cst_15 = arith.constant dense<1.000000e-05> : tensor<1xf64>
    %cst_16 = arith.constant dense<32> : tensor<1xi64>
    %cst_17 = arith.constant dense<0.17677669529663687> : tensor<1xf64>
    %cst_18 = arith.constant dense<15> : tensor<1xi64>
    %0 = "stablehlo.gather"(%arg0, %arg26) <{dimension_numbers = #stablehlo.gather<offset_dims = [2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 2>, indices_are_sorted = false, slice_sizes = array<i64: 1, 256>}> : (tensor<65536x256xbf16>, tensor<4x2048xi64>) -> tensor<4x2048x256xbf16>
    %1 = stablehlo.convert %0 : tensor<4x2048x256xbf16>
    %2 = stablehlo.convert %1 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x256xf32>
    %3 = stablehlo.convert %cst_13 : (tensor<1xi64>) -> tensor<1xf32>
    %4 = stablehlo.reshape %3 : (tensor<1xf32>) -> tensor<f32>
    %5 = stablehlo.broadcast_in_dim %4, dims = [] : (tensor<f32>) -> tensor<4x2048x256xf32>
    %6 = stablehlo.power %2, %5 : tensor<4x2048x256xf32>
    %7 = stablehlo.reduce(%6 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<4x2048x256xf32>, tensor<f32>) -> tensor<4x2048xf32>
    %8 = stablehlo.reshape %7 : (tensor<4x2048xf32>) -> tensor<4x2048x1xf32>
    %9 = stablehlo.convert %cst_14 : (tensor<1xi64>) -> tensor<1xf32>
    %10 = stablehlo.reshape %9 : (tensor<1xf32>) -> tensor<f32>
    %11 = stablehlo.broadcast_in_dim %10, dims = [] : (tensor<f32>) -> tensor<4x2048x1xf32>
    %12 = stablehlo.divide %8, %11 : tensor<4x2048x1xf32>
    %13 = stablehlo.convert %cst_15 : (tensor<1xf64>) -> tensor<1xf32>
    %14 = stablehlo.reshape %13 : (tensor<1xf32>) -> tensor<f32>
    %15 = stablehlo.broadcast_in_dim %14, dims = [] : (tensor<f32>) -> tensor<4x2048x1xf32>
    %16 = stablehlo.add %12, %15 : tensor<4x2048x1xf32>
    %17 = stablehlo.rsqrt %16 : tensor<4x2048x1xf32>
    %18 = stablehlo.convert %17 : (tensor<4x2048x1xf32>) -> tensor<4x2048x1xbf16>
    %19 = stablehlo.broadcast_in_dim %18, dims = [0, 1, 2] : (tensor<4x2048x1xbf16>) -> tensor<4x2048x256xbf16>
    %20 = stablehlo.multiply %1, %19 : tensor<4x2048x256xbf16>
    %21 = stablehlo.convert %20 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x256xf32>
    %22 = stablehlo.power %21, %5 : tensor<4x2048x256xf32>
    %23 = stablehlo.reduce(%22 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<4x2048x256xf32>, tensor<f32>) -> tensor<4x2048xf32>
    %24 = stablehlo.reshape %23 : (tensor<4x2048xf32>) -> tensor<4x2048x1xf32>
    %25 = stablehlo.divide %24, %11 : tensor<4x2048x1xf32>
    %26 = stablehlo.add %25, %15 : tensor<4x2048x1xf32>
    %27 = stablehlo.rsqrt %26 : tensor<4x2048x1xf32>
    %28 = stablehlo.convert %27 : (tensor<4x2048x1xf32>) -> tensor<4x2048x1xbf16>
    %29 = stablehlo.broadcast_in_dim %28, dims = [0, 1, 2] : (tensor<4x2048x1xbf16>) -> tensor<4x2048x256xbf16>
    %30 = stablehlo.multiply %20, %29 : tensor<4x2048x256xbf16>
    %31 = stablehlo.transpose %arg1, dims = [1, 0] : (tensor<256x256xbf16>) -> tensor<256x256xbf16>
    %32 = stablehlo.reshape %30 : (tensor<4x2048x256xbf16>) -> tensor<8192x256xbf16>
    %33 = stablehlo.dot_general %32, %31, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x256xbf16>) -> tensor<8192x256xbf16>
    %34 = stablehlo.reshape %33 : (tensor<8192x256xbf16>) -> tensor<4x2048x256xbf16>
    %35 = stablehlo.reshape %34 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x8x32xbf16>
    %36 = stablehlo.transpose %arg2, dims = [1, 0] : (tensor<128x256xbf16>) -> tensor<256x128xbf16>
    %37 = stablehlo.dot_general %32, %36, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x128xbf16>) -> tensor<8192x128xbf16>
    %38 = stablehlo.reshape %37 : (tensor<8192x128xbf16>) -> tensor<4x2048x128xbf16>
    %39 = stablehlo.reshape %38 : (tensor<4x2048x128xbf16>) -> tensor<4x2048x4x32xbf16>
    %40 = stablehlo.transpose %arg3, dims = [1, 0] : (tensor<128x256xbf16>) -> tensor<256x128xbf16>
    %41 = stablehlo.dot_general %32, %40, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x128xbf16>) -> tensor<8192x128xbf16>
    %42 = stablehlo.reshape %41 : (tensor<8192x128xbf16>) -> tensor<4x2048x128xbf16>
    %43 = stablehlo.reshape %42 : (tensor<4x2048x128xbf16>) -> tensor<4x2048x4x32xbf16>
    %44 = stablehlo.slice %35 [0:4, 0:2048, 0:8, 0:16] : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x16xbf16>
    %45 = stablehlo.slice %35 [0:4, 0:2048, 0:8, 16:32] : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x16xbf16>
    %46 = stablehlo.broadcast_in_dim %cst_10, dims = [0, 1, 2, 3] : (tensor<1x2048x1x16xbf16>) -> tensor<4x2048x8x16xbf16>
    %47 = stablehlo.multiply %44, %46 : tensor<4x2048x8x16xbf16>
    %48 = stablehlo.broadcast_in_dim %cst_9, dims = [0, 1, 2, 3] : (tensor<1x2048x1x16xbf16>) -> tensor<4x2048x8x16xbf16>
    %49 = stablehlo.multiply %45, %48 : tensor<4x2048x8x16xbf16>
    %50 = stablehlo.add %47, %49 : tensor<4x2048x8x16xbf16>
    %51 = stablehlo.negate %cst_9 : tensor<1x2048x1x16xbf16>
    %52 = stablehlo.broadcast_in_dim %51, dims = [0, 1, 2, 3] : (tensor<1x2048x1x16xbf16>) -> tensor<4x2048x8x16xbf16>
    %53 = stablehlo.multiply %44, %52 : tensor<4x2048x8x16xbf16>
    %54 = stablehlo.multiply %45, %46 : tensor<4x2048x8x16xbf16>
    %55 = stablehlo.add %53, %54 : tensor<4x2048x8x16xbf16>
    %56 = stablehlo.concatenate %50, %55, dim = 3 : (tensor<4x2048x8x16xbf16>, tensor<4x2048x8x16xbf16>) -> tensor<4x2048x8x32xbf16>
    %57 = stablehlo.slice %39 [0:4, 0:2048, 0:4, 0:16] : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x16xbf16>
    %58 = stablehlo.slice %39 [0:4, 0:2048, 0:4, 16:32] : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x16xbf16>
    %59 = stablehlo.broadcast_in_dim %cst_10, dims = [0, 1, 2, 3] : (tensor<1x2048x1x16xbf16>) -> tensor<4x2048x4x16xbf16>
    %60 = stablehlo.multiply %57, %59 : tensor<4x2048x4x16xbf16>
    %61 = stablehlo.broadcast_in_dim %cst_9, dims = [0, 1, 2, 3] : (tensor<1x2048x1x16xbf16>) -> tensor<4x2048x4x16xbf16>
    %62 = stablehlo.multiply %58, %61 : tensor<4x2048x4x16xbf16>
    %63 = stablehlo.add %60, %62 : tensor<4x2048x4x16xbf16>
    %64 = stablehlo.broadcast_in_dim %51, dims = [0, 1, 2, 3] : (tensor<1x2048x1x16xbf16>) -> tensor<4x2048x4x16xbf16>
    %65 = stablehlo.multiply %57, %64 : tensor<4x2048x4x16xbf16>
    %66 = stablehlo.multiply %58, %59 : tensor<4x2048x4x16xbf16>
    %67 = stablehlo.add %65, %66 : tensor<4x2048x4x16xbf16>
    %68 = stablehlo.concatenate %63, %67, dim = 3 : (tensor<4x2048x4x16xbf16>, tensor<4x2048x4x16xbf16>) -> tensor<4x2048x4x32xbf16>
    %69 = stablehlo.convert %56 : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x32xf32>
    %70 = stablehlo.broadcast_in_dim %4, dims = [] : (tensor<f32>) -> tensor<4x2048x8x32xf32>
    %71 = stablehlo.power %69, %70 : tensor<4x2048x8x32xf32>
    %72 = stablehlo.reduce(%71 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x2048x8x32xf32>, tensor<f32>) -> tensor<4x2048x8xf32>
    %73 = stablehlo.reshape %72 : (tensor<4x2048x8xf32>) -> tensor<4x2048x8x1xf32>
    %74 = stablehlo.convert %cst_16 : (tensor<1xi64>) -> tensor<1xf32>
    %75 = stablehlo.reshape %74 : (tensor<1xf32>) -> tensor<f32>
    %76 = stablehlo.broadcast_in_dim %75, dims = [] : (tensor<f32>) -> tensor<4x2048x8x1xf32>
    %77 = stablehlo.divide %73, %76 : tensor<4x2048x8x1xf32>
    %78 = stablehlo.broadcast_in_dim %14, dims = [] : (tensor<f32>) -> tensor<4x2048x8x1xf32>
    %79 = stablehlo.add %77, %78 : tensor<4x2048x8x1xf32>
    %80 = stablehlo.rsqrt %79 : tensor<4x2048x8x1xf32>
    %81 = stablehlo.convert %80 : (tensor<4x2048x8x1xf32>) -> tensor<4x2048x8x1xbf16>
    %82 = stablehlo.broadcast_in_dim %81, dims = [0, 1, 2, 3] : (tensor<4x2048x8x1xbf16>) -> tensor<4x2048x8x32xbf16>
    %83 = stablehlo.multiply %56, %82 : tensor<4x2048x8x32xbf16>
    %84 = stablehlo.convert %68 : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x32xf32>
    %85 = stablehlo.broadcast_in_dim %4, dims = [] : (tensor<f32>) -> tensor<4x2048x4x32xf32>
    %86 = stablehlo.power %84, %85 : tensor<4x2048x4x32xf32>
    %87 = stablehlo.reduce(%86 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x2048x4x32xf32>, tensor<f32>) -> tensor<4x2048x4xf32>
    %88 = stablehlo.reshape %87 : (tensor<4x2048x4xf32>) -> tensor<4x2048x4x1xf32>
    %89 = stablehlo.broadcast_in_dim %75, dims = [] : (tensor<f32>) -> tensor<4x2048x4x1xf32>
    %90 = stablehlo.divide %88, %89 : tensor<4x2048x4x1xf32>
    %91 = stablehlo.broadcast_in_dim %14, dims = [] : (tensor<f32>) -> tensor<4x2048x4x1xf32>
    %92 = stablehlo.add %90, %91 : tensor<4x2048x4x1xf32>
    %93 = stablehlo.rsqrt %92 : tensor<4x2048x4x1xf32>
    %94 = stablehlo.convert %93 : (tensor<4x2048x4x1xf32>) -> tensor<4x2048x4x1xbf16>
    %95 = stablehlo.broadcast_in_dim %94, dims = [0, 1, 2, 3] : (tensor<4x2048x4x1xbf16>) -> tensor<4x2048x4x32xbf16>
    %96 = stablehlo.multiply %68, %95 : tensor<4x2048x4x32xbf16>
    %97 = stablehlo.transpose %83, dims = [0, 2, 1, 3] : (tensor<4x2048x8x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %98 = stablehlo.transpose %96, dims = [0, 2, 1, 3] : (tensor<4x2048x4x32xbf16>) -> tensor<4x4x2048x32xbf16>
    %99 = stablehlo.transpose %43, dims = [0, 2, 1, 3] : (tensor<4x2048x4x32xbf16>) -> tensor<4x4x2048x32xbf16>
    %100 = stablehlo.reshape %98 : (tensor<4x4x2048x32xbf16>) -> tensor<4x4x1x2048x32xbf16>
    %101 = stablehlo.broadcast_in_dim %100, dims = [0, 1, 2, 3, 4] : (tensor<4x4x1x2048x32xbf16>) -> tensor<4x4x2x2048x32xbf16>
    %102 = stablehlo.reshape %101 : (tensor<4x4x2x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %103 = stablehlo.reshape %99 : (tensor<4x4x2048x32xbf16>) -> tensor<4x4x1x2048x32xbf16>
    %104 = stablehlo.broadcast_in_dim %103, dims = [0, 1, 2, 3, 4] : (tensor<4x4x1x2048x32xbf16>) -> tensor<4x4x2x2048x32xbf16>
    %105 = stablehlo.reshape %104 : (tensor<4x4x2x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %106 = stablehlo.transpose %102, dims = [0, 1, 3, 2] : (tensor<4x8x2048x32xbf16>) -> tensor<4x8x32x2048xbf16>
    %107 = stablehlo.reshape %97 : (tensor<4x8x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %108 = stablehlo.reshape %106 : (tensor<4x8x32x2048xbf16>) -> tensor<32x32x2048xbf16>
    %109 = stablehlo.broadcast_in_dim %108, dims = [0, 1, 2] : (tensor<32x32x2048xbf16>) -> tensor<32x32x2048xbf16>
    %110 = stablehlo.dot_general %107, %109, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x2048x32xbf16>, tensor<32x32x2048xbf16>) -> tensor<32x2048x2048xbf16>
    %111 = stablehlo.reshape %110 : (tensor<32x2048x2048xbf16>) -> tensor<4x8x2048x2048xbf16>
    %112 = stablehlo.convert %cst_17 : (tensor<1xf64>) -> tensor<1xbf16>
    %113 = stablehlo.reshape %112 : (tensor<1xbf16>) -> tensor<bf16>
    %114 = stablehlo.broadcast_in_dim %113, dims = [] : (tensor<bf16>) -> tensor<4x8x2048x2048xbf16>
    %115 = stablehlo.multiply %111, %114 : tensor<4x8x2048x2048xbf16>
    %116 = stablehlo.convert %c_5 : (tensor<i64>) -> tensor<f64>
    %117 = stablehlo.convert %c_4 : (tensor<i64>) -> tensor<f64>
    %118 = stablehlo.divide %117, %116 : tensor<f64>
    %119 = stablehlo.ceil %118 : tensor<f64>
    %120 = stablehlo.convert %119 : (tensor<f64>) -> tensor<i64>
    %121 = stablehlo.reshape %120 : (tensor<i64>) -> tensor<1xi64>
    %122 = stablehlo.dynamic_iota %121, dim = 0 : (tensor<1xi64>) -> tensor<2048xi64>
    %123 = stablehlo.multiply %122, %c_3 : tensor<2048xi64>
    %124 = stablehlo.add %123, %c_2 : tensor<2048xi64>
    %125 = stablehlo.reshape %124 : (tensor<2048xi64>) -> tensor<1x2048xi64>
    %126 = stablehlo.reshape %124 : (tensor<2048xi64>) -> tensor<2048x1xi64>
    %127 = stablehlo.broadcast_in_dim %125, dims = [0, 1] : (tensor<1x2048xi64>) -> tensor<2048x2048xi64>
    %128 = stablehlo.broadcast_in_dim %126, dims = [0, 1] : (tensor<2048x1xi64>) -> tensor<2048x2048xi64>
    %129 = stablehlo.subtract %127, %128 : tensor<2048x2048xi64>
    %130 = stablehlo.compare  GE, %129, %c_1,  SIGNED : (tensor<2048x2048xi64>, tensor<2048x2048xi64>) -> tensor<2048x2048xi1>
    %131 = stablehlo.and %130, %c_8 : tensor<2048x2048xi1>
    %132 = stablehlo.reshape %131 : (tensor<2048x2048xi1>) -> tensor<1x1x2048x2048xi1>
    %133 = stablehlo.broadcast_in_dim %132, dims = [0, 1, 2, 3] : (tensor<1x1x2048x2048xi1>) -> tensor<4x8x2048x2048xi1>
    %134 = stablehlo.broadcast_in_dim %cst_7, dims = [] : (tensor<bf16>) -> tensor<4x8x2048x2048xbf16>
    %135 = stablehlo.broadcast_in_dim %115, dims = [0, 1, 2, 3] : (tensor<4x8x2048x2048xbf16>) -> tensor<4x8x2048x2048xbf16>
    %136 = stablehlo.select %133, %134, %135 : tensor<4x8x2048x2048xi1>, tensor<4x8x2048x2048xbf16>
    %137 = stablehlo.convert %136 : (tensor<4x8x2048x2048xbf16>) -> tensor<4x8x2048x2048xf32>
    %138 = stablehlo.reduce(%137 init: %cst_11) applies stablehlo.maximum across dimensions = [3] : (tensor<4x8x2048x2048xf32>, tensor<f32>) -> tensor<4x8x2048xf32>
    %139 = stablehlo.reshape %138 : (tensor<4x8x2048xf32>) -> tensor<4x8x2048x1xf32>
    %140 = stablehlo.broadcast_in_dim %139, dims = [0, 1, 2, 3] : (tensor<4x8x2048x1xf32>) -> tensor<4x8x2048x2048xf32>
    %141 = stablehlo.subtract %137, %140 : tensor<4x8x2048x2048xf32>
    %142 = stablehlo.exponential %141 : tensor<4x8x2048x2048xf32>
    %143 = stablehlo.reduce(%142 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x8x2048x2048xf32>, tensor<f32>) -> tensor<4x8x2048xf32>
    %144 = stablehlo.reshape %143 : (tensor<4x8x2048xf32>) -> tensor<4x8x2048x1xf32>
    %145 = stablehlo.broadcast_in_dim %144, dims = [0, 1, 2, 3] : (tensor<4x8x2048x1xf32>) -> tensor<4x8x2048x2048xf32>
    %146 = stablehlo.divide %142, %145 : tensor<4x8x2048x2048xf32>
    %147 = stablehlo.convert %146 : (tensor<4x8x2048x2048xf32>) -> tensor<4x8x2048x2048xbf16>
    %148 = stablehlo.reshape %147 : (tensor<4x8x2048x2048xbf16>) -> tensor<32x2048x2048xbf16>
    %149 = stablehlo.reshape %105 : (tensor<4x8x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %150 = stablehlo.broadcast_in_dim %149, dims = [0, 1, 2] : (tensor<32x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %151 = stablehlo.dot_general %148, %150, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x2048x2048xbf16>, tensor<32x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %152 = stablehlo.reshape %151 : (tensor<32x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %153 = stablehlo.transpose %152, dims = [0, 2, 1, 3] : (tensor<4x8x2048x32xbf16>) -> tensor<4x2048x8x32xbf16>
    %154 = stablehlo.reshape %153 : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x256xbf16>
    %155 = stablehlo.transpose %arg4, dims = [1, 0] : (tensor<256x256xbf16>) -> tensor<256x256xbf16>
    %156 = stablehlo.reshape %154 : (tensor<4x2048x256xbf16>) -> tensor<8192x256xbf16>
    %157 = stablehlo.dot_general %156, %155, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x256xbf16>) -> tensor<8192x256xbf16>
    %158 = stablehlo.reshape %157 : (tensor<8192x256xbf16>) -> tensor<4x2048x256xbf16>
    %159 = stablehlo.add %20, %158 : tensor<4x2048x256xbf16>
    %160 = stablehlo.convert %159 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x256xf32>
    %161 = stablehlo.power %160, %5 : tensor<4x2048x256xf32>
    %162 = stablehlo.reduce(%161 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<4x2048x256xf32>, tensor<f32>) -> tensor<4x2048xf32>
    %163 = stablehlo.reshape %162 : (tensor<4x2048xf32>) -> tensor<4x2048x1xf32>
    %164 = stablehlo.divide %163, %11 : tensor<4x2048x1xf32>
    %165 = stablehlo.add %164, %15 : tensor<4x2048x1xf32>
    %166 = stablehlo.rsqrt %165 : tensor<4x2048x1xf32>
    %167 = stablehlo.convert %166 : (tensor<4x2048x1xf32>) -> tensor<4x2048x1xbf16>
    %168 = stablehlo.broadcast_in_dim %167, dims = [0, 1, 2] : (tensor<4x2048x1xbf16>) -> tensor<4x2048x256xbf16>
    %169 = stablehlo.multiply %159, %168 : tensor<4x2048x256xbf16>
    %170 = stablehlo.transpose %arg5, dims = [1, 0] : (tensor<1024x256xbf16>) -> tensor<256x1024xbf16>
    %171 = stablehlo.reshape %169 : (tensor<4x2048x256xbf16>) -> tensor<8192x256xbf16>
    %172 = stablehlo.dot_general %171, %170, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x1024xbf16>) -> tensor<8192x1024xbf16>
    %173 = stablehlo.reshape %172 : (tensor<8192x1024xbf16>) -> tensor<4x2048x1024xbf16>
    %174 = stablehlo.maximum %173, %cst_12 : tensor<4x2048x1024xbf16>
    %175 = stablehlo.convert %cst_13 : (tensor<1xi64>) -> tensor<1xbf16>
    %176 = stablehlo.reshape %175 : (tensor<1xbf16>) -> tensor<bf16>
    %177 = stablehlo.broadcast_in_dim %176, dims = [] : (tensor<bf16>) -> tensor<4x2048x1024xbf16>
    %178 = stablehlo.power %174, %177 : tensor<4x2048x1024xbf16>
    %179 = stablehlo.transpose %arg6, dims = [1, 0] : (tensor<256x1024xbf16>) -> tensor<1024x256xbf16>
    %180 = stablehlo.reshape %178 : (tensor<4x2048x1024xbf16>) -> tensor<8192x1024xbf16>
    %181 = stablehlo.dot_general %180, %179, contracting_dims = [1] x [0] : (tensor<8192x1024xbf16>, tensor<1024x256xbf16>) -> tensor<8192x256xbf16>
    %182 = stablehlo.reshape %181 : (tensor<8192x256xbf16>) -> tensor<4x2048x256xbf16>
    %183 = stablehlo.add %159, %182 : tensor<4x2048x256xbf16>
    %184 = stablehlo.convert %183 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x256xf32>
    %185 = stablehlo.power %184, %5 : tensor<4x2048x256xf32>
    %186 = stablehlo.reduce(%185 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<4x2048x256xf32>, tensor<f32>) -> tensor<4x2048xf32>
    %187 = stablehlo.reshape %186 : (tensor<4x2048xf32>) -> tensor<4x2048x1xf32>
    %188 = stablehlo.divide %187, %11 : tensor<4x2048x1xf32>
    %189 = stablehlo.add %188, %15 : tensor<4x2048x1xf32>
    %190 = stablehlo.rsqrt %189 : tensor<4x2048x1xf32>
    %191 = stablehlo.convert %190 : (tensor<4x2048x1xf32>) -> tensor<4x2048x1xbf16>
    %192 = stablehlo.broadcast_in_dim %191, dims = [0, 1, 2] : (tensor<4x2048x1xbf16>) -> tensor<4x2048x256xbf16>
    %193 = stablehlo.multiply %183, %192 : tensor<4x2048x256xbf16>
    %194 = stablehlo.transpose %arg7, dims = [1, 0] : (tensor<256x256xbf16>) -> tensor<256x256xbf16>
    %195 = stablehlo.reshape %193 : (tensor<4x2048x256xbf16>) -> tensor<8192x256xbf16>
    %196 = stablehlo.dot_general %195, %194, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x256xbf16>) -> tensor<8192x256xbf16>
    %197 = stablehlo.reshape %196 : (tensor<8192x256xbf16>) -> tensor<4x2048x256xbf16>
    %198 = stablehlo.reshape %197 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x8x32xbf16>
    %199 = stablehlo.transpose %arg8, dims = [1, 0] : (tensor<128x256xbf16>) -> tensor<256x128xbf16>
    %200 = stablehlo.dot_general %195, %199, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x128xbf16>) -> tensor<8192x128xbf16>
    %201 = stablehlo.reshape %200 : (tensor<8192x128xbf16>) -> tensor<4x2048x128xbf16>
    %202 = stablehlo.reshape %201 : (tensor<4x2048x128xbf16>) -> tensor<4x2048x4x32xbf16>
    %203 = stablehlo.transpose %arg9, dims = [1, 0] : (tensor<128x256xbf16>) -> tensor<256x128xbf16>
    %204 = stablehlo.dot_general %195, %203, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x128xbf16>) -> tensor<8192x128xbf16>
    %205 = stablehlo.reshape %204 : (tensor<8192x128xbf16>) -> tensor<4x2048x128xbf16>
    %206 = stablehlo.reshape %205 : (tensor<4x2048x128xbf16>) -> tensor<4x2048x4x32xbf16>
    %207 = stablehlo.slice %198 [0:4, 0:2048, 0:8, 0:16] : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x16xbf16>
    %208 = stablehlo.slice %198 [0:4, 0:2048, 0:8, 16:32] : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x16xbf16>
    %209 = stablehlo.multiply %207, %46 : tensor<4x2048x8x16xbf16>
    %210 = stablehlo.multiply %208, %48 : tensor<4x2048x8x16xbf16>
    %211 = stablehlo.add %209, %210 : tensor<4x2048x8x16xbf16>
    %212 = stablehlo.multiply %207, %52 : tensor<4x2048x8x16xbf16>
    %213 = stablehlo.multiply %208, %46 : tensor<4x2048x8x16xbf16>
    %214 = stablehlo.add %212, %213 : tensor<4x2048x8x16xbf16>
    %215 = stablehlo.concatenate %211, %214, dim = 3 : (tensor<4x2048x8x16xbf16>, tensor<4x2048x8x16xbf16>) -> tensor<4x2048x8x32xbf16>
    %216 = stablehlo.slice %202 [0:4, 0:2048, 0:4, 0:16] : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x16xbf16>
    %217 = stablehlo.slice %202 [0:4, 0:2048, 0:4, 16:32] : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x16xbf16>
    %218 = stablehlo.multiply %216, %59 : tensor<4x2048x4x16xbf16>
    %219 = stablehlo.multiply %217, %61 : tensor<4x2048x4x16xbf16>
    %220 = stablehlo.add %218, %219 : tensor<4x2048x4x16xbf16>
    %221 = stablehlo.multiply %216, %64 : tensor<4x2048x4x16xbf16>
    %222 = stablehlo.multiply %217, %59 : tensor<4x2048x4x16xbf16>
    %223 = stablehlo.add %221, %222 : tensor<4x2048x4x16xbf16>
    %224 = stablehlo.concatenate %220, %223, dim = 3 : (tensor<4x2048x4x16xbf16>, tensor<4x2048x4x16xbf16>) -> tensor<4x2048x4x32xbf16>
    %225 = stablehlo.convert %215 : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x32xf32>
    %226 = stablehlo.power %225, %70 : tensor<4x2048x8x32xf32>
    %227 = stablehlo.reduce(%226 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x2048x8x32xf32>, tensor<f32>) -> tensor<4x2048x8xf32>
    %228 = stablehlo.reshape %227 : (tensor<4x2048x8xf32>) -> tensor<4x2048x8x1xf32>
    %229 = stablehlo.divide %228, %76 : tensor<4x2048x8x1xf32>
    %230 = stablehlo.add %229, %78 : tensor<4x2048x8x1xf32>
    %231 = stablehlo.rsqrt %230 : tensor<4x2048x8x1xf32>
    %232 = stablehlo.convert %231 : (tensor<4x2048x8x1xf32>) -> tensor<4x2048x8x1xbf16>
    %233 = stablehlo.broadcast_in_dim %232, dims = [0, 1, 2, 3] : (tensor<4x2048x8x1xbf16>) -> tensor<4x2048x8x32xbf16>
    %234 = stablehlo.multiply %215, %233 : tensor<4x2048x8x32xbf16>
    %235 = stablehlo.convert %224 : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x32xf32>
    %236 = stablehlo.power %235, %85 : tensor<4x2048x4x32xf32>
    %237 = stablehlo.reduce(%236 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x2048x4x32xf32>, tensor<f32>) -> tensor<4x2048x4xf32>
    %238 = stablehlo.reshape %237 : (tensor<4x2048x4xf32>) -> tensor<4x2048x4x1xf32>
    %239 = stablehlo.divide %238, %89 : tensor<4x2048x4x1xf32>
    %240 = stablehlo.add %239, %91 : tensor<4x2048x4x1xf32>
    %241 = stablehlo.rsqrt %240 : tensor<4x2048x4x1xf32>
    %242 = stablehlo.convert %241 : (tensor<4x2048x4x1xf32>) -> tensor<4x2048x4x1xbf16>
    %243 = stablehlo.broadcast_in_dim %242, dims = [0, 1, 2, 3] : (tensor<4x2048x4x1xbf16>) -> tensor<4x2048x4x32xbf16>
    %244 = stablehlo.multiply %224, %243 : tensor<4x2048x4x32xbf16>
    %245 = stablehlo.transpose %234, dims = [0, 2, 1, 3] : (tensor<4x2048x8x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %246 = stablehlo.transpose %244, dims = [0, 2, 1, 3] : (tensor<4x2048x4x32xbf16>) -> tensor<4x4x2048x32xbf16>
    %247 = stablehlo.transpose %206, dims = [0, 2, 1, 3] : (tensor<4x2048x4x32xbf16>) -> tensor<4x4x2048x32xbf16>
    %248 = stablehlo.reshape %246 : (tensor<4x4x2048x32xbf16>) -> tensor<4x4x1x2048x32xbf16>
    %249 = stablehlo.broadcast_in_dim %248, dims = [0, 1, 2, 3, 4] : (tensor<4x4x1x2048x32xbf16>) -> tensor<4x4x2x2048x32xbf16>
    %250 = stablehlo.reshape %249 : (tensor<4x4x2x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %251 = stablehlo.reshape %247 : (tensor<4x4x2048x32xbf16>) -> tensor<4x4x1x2048x32xbf16>
    %252 = stablehlo.broadcast_in_dim %251, dims = [0, 1, 2, 3, 4] : (tensor<4x4x1x2048x32xbf16>) -> tensor<4x4x2x2048x32xbf16>
    %253 = stablehlo.reshape %252 : (tensor<4x4x2x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %254 = stablehlo.transpose %250, dims = [0, 1, 3, 2] : (tensor<4x8x2048x32xbf16>) -> tensor<4x8x32x2048xbf16>
    %255 = stablehlo.reshape %245 : (tensor<4x8x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %256 = stablehlo.reshape %254 : (tensor<4x8x32x2048xbf16>) -> tensor<32x32x2048xbf16>
    %257 = stablehlo.broadcast_in_dim %256, dims = [0, 1, 2] : (tensor<32x32x2048xbf16>) -> tensor<32x32x2048xbf16>
    %258 = stablehlo.dot_general %255, %257, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x2048x32xbf16>, tensor<32x32x2048xbf16>) -> tensor<32x2048x2048xbf16>
    %259 = stablehlo.reshape %258 : (tensor<32x2048x2048xbf16>) -> tensor<4x8x2048x2048xbf16>
    %260 = stablehlo.multiply %259, %114 : tensor<4x8x2048x2048xbf16>
    %261 = stablehlo.broadcast_in_dim %260, dims = [0, 1, 2, 3] : (tensor<4x8x2048x2048xbf16>) -> tensor<4x8x2048x2048xbf16>
    %262 = stablehlo.select %133, %134, %261 : tensor<4x8x2048x2048xi1>, tensor<4x8x2048x2048xbf16>
    %263 = stablehlo.convert %262 : (tensor<4x8x2048x2048xbf16>) -> tensor<4x8x2048x2048xf32>
    %264 = stablehlo.reduce(%263 init: %cst_11) applies stablehlo.maximum across dimensions = [3] : (tensor<4x8x2048x2048xf32>, tensor<f32>) -> tensor<4x8x2048xf32>
    %265 = stablehlo.reshape %264 : (tensor<4x8x2048xf32>) -> tensor<4x8x2048x1xf32>
    %266 = stablehlo.broadcast_in_dim %265, dims = [0, 1, 2, 3] : (tensor<4x8x2048x1xf32>) -> tensor<4x8x2048x2048xf32>
    %267 = stablehlo.subtract %263, %266 : tensor<4x8x2048x2048xf32>
    %268 = stablehlo.exponential %267 : tensor<4x8x2048x2048xf32>
    %269 = stablehlo.reduce(%268 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x8x2048x2048xf32>, tensor<f32>) -> tensor<4x8x2048xf32>
    %270 = stablehlo.reshape %269 : (tensor<4x8x2048xf32>) -> tensor<4x8x2048x1xf32>
    %271 = stablehlo.broadcast_in_dim %270, dims = [0, 1, 2, 3] : (tensor<4x8x2048x1xf32>) -> tensor<4x8x2048x2048xf32>
    %272 = stablehlo.divide %268, %271 : tensor<4x8x2048x2048xf32>
    %273 = stablehlo.convert %272 : (tensor<4x8x2048x2048xf32>) -> tensor<4x8x2048x2048xbf16>
    %274 = stablehlo.reshape %273 : (tensor<4x8x2048x2048xbf16>) -> tensor<32x2048x2048xbf16>
    %275 = stablehlo.reshape %253 : (tensor<4x8x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %276 = stablehlo.broadcast_in_dim %275, dims = [0, 1, 2] : (tensor<32x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %277 = stablehlo.dot_general %274, %276, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x2048x2048xbf16>, tensor<32x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %278 = stablehlo.reshape %277 : (tensor<32x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %279 = stablehlo.transpose %278, dims = [0, 2, 1, 3] : (tensor<4x8x2048x32xbf16>) -> tensor<4x2048x8x32xbf16>
    %280 = stablehlo.reshape %279 : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x256xbf16>
    %281 = stablehlo.transpose %arg10, dims = [1, 0] : (tensor<256x256xbf16>) -> tensor<256x256xbf16>
    %282 = stablehlo.reshape %280 : (tensor<4x2048x256xbf16>) -> tensor<8192x256xbf16>
    %283 = stablehlo.dot_general %282, %281, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x256xbf16>) -> tensor<8192x256xbf16>
    %284 = stablehlo.reshape %283 : (tensor<8192x256xbf16>) -> tensor<4x2048x256xbf16>
    %285 = stablehlo.add %183, %284 : tensor<4x2048x256xbf16>
    %286 = stablehlo.convert %285 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x256xf32>
    %287 = stablehlo.power %286, %5 : tensor<4x2048x256xf32>
    %288 = stablehlo.reduce(%287 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<4x2048x256xf32>, tensor<f32>) -> tensor<4x2048xf32>
    %289 = stablehlo.reshape %288 : (tensor<4x2048xf32>) -> tensor<4x2048x1xf32>
    %290 = stablehlo.divide %289, %11 : tensor<4x2048x1xf32>
    %291 = stablehlo.add %290, %15 : tensor<4x2048x1xf32>
    %292 = stablehlo.rsqrt %291 : tensor<4x2048x1xf32>
    %293 = stablehlo.convert %292 : (tensor<4x2048x1xf32>) -> tensor<4x2048x1xbf16>
    %294 = stablehlo.broadcast_in_dim %293, dims = [0, 1, 2] : (tensor<4x2048x1xbf16>) -> tensor<4x2048x256xbf16>
    %295 = stablehlo.multiply %285, %294 : tensor<4x2048x256xbf16>
    %296 = stablehlo.transpose %arg11, dims = [1, 0] : (tensor<1024x256xbf16>) -> tensor<256x1024xbf16>
    %297 = stablehlo.reshape %295 : (tensor<4x2048x256xbf16>) -> tensor<8192x256xbf16>
    %298 = stablehlo.dot_general %297, %296, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x1024xbf16>) -> tensor<8192x1024xbf16>
    %299 = stablehlo.reshape %298 : (tensor<8192x1024xbf16>) -> tensor<4x2048x1024xbf16>
    %300 = stablehlo.maximum %299, %cst_12 : tensor<4x2048x1024xbf16>
    %301 = stablehlo.power %300, %177 : tensor<4x2048x1024xbf16>
    %302 = stablehlo.transpose %arg12, dims = [1, 0] : (tensor<256x1024xbf16>) -> tensor<1024x256xbf16>
    %303 = stablehlo.reshape %301 : (tensor<4x2048x1024xbf16>) -> tensor<8192x1024xbf16>
    %304 = stablehlo.dot_general %303, %302, contracting_dims = [1] x [0] : (tensor<8192x1024xbf16>, tensor<1024x256xbf16>) -> tensor<8192x256xbf16>
    %305 = stablehlo.reshape %304 : (tensor<8192x256xbf16>) -> tensor<4x2048x256xbf16>
    %306 = stablehlo.add %285, %305 : tensor<4x2048x256xbf16>
    %307 = stablehlo.convert %306 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x256xf32>
    %308 = stablehlo.power %307, %5 : tensor<4x2048x256xf32>
    %309 = stablehlo.reduce(%308 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<4x2048x256xf32>, tensor<f32>) -> tensor<4x2048xf32>
    %310 = stablehlo.reshape %309 : (tensor<4x2048xf32>) -> tensor<4x2048x1xf32>
    %311 = stablehlo.divide %310, %11 : tensor<4x2048x1xf32>
    %312 = stablehlo.add %311, %15 : tensor<4x2048x1xf32>
    %313 = stablehlo.rsqrt %312 : tensor<4x2048x1xf32>
    %314 = stablehlo.convert %313 : (tensor<4x2048x1xf32>) -> tensor<4x2048x1xbf16>
    %315 = stablehlo.broadcast_in_dim %314, dims = [0, 1, 2] : (tensor<4x2048x1xbf16>) -> tensor<4x2048x256xbf16>
    %316 = stablehlo.multiply %306, %315 : tensor<4x2048x256xbf16>
    %317 = stablehlo.transpose %arg13, dims = [1, 0] : (tensor<256x256xbf16>) -> tensor<256x256xbf16>
    %318 = stablehlo.reshape %316 : (tensor<4x2048x256xbf16>) -> tensor<8192x256xbf16>
    %319 = stablehlo.dot_general %318, %317, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x256xbf16>) -> tensor<8192x256xbf16>
    %320 = stablehlo.reshape %319 : (tensor<8192x256xbf16>) -> tensor<4x2048x256xbf16>
    %321 = stablehlo.reshape %320 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x8x32xbf16>
    %322 = stablehlo.transpose %arg14, dims = [1, 0] : (tensor<128x256xbf16>) -> tensor<256x128xbf16>
    %323 = stablehlo.dot_general %318, %322, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x128xbf16>) -> tensor<8192x128xbf16>
    %324 = stablehlo.reshape %323 : (tensor<8192x128xbf16>) -> tensor<4x2048x128xbf16>
    %325 = stablehlo.reshape %324 : (tensor<4x2048x128xbf16>) -> tensor<4x2048x4x32xbf16>
    %326 = stablehlo.transpose %arg15, dims = [1, 0] : (tensor<128x256xbf16>) -> tensor<256x128xbf16>
    %327 = stablehlo.dot_general %318, %326, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x128xbf16>) -> tensor<8192x128xbf16>
    %328 = stablehlo.reshape %327 : (tensor<8192x128xbf16>) -> tensor<4x2048x128xbf16>
    %329 = stablehlo.reshape %328 : (tensor<4x2048x128xbf16>) -> tensor<4x2048x4x32xbf16>
    %330 = stablehlo.slice %321 [0:4, 0:2048, 0:8, 0:16] : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x16xbf16>
    %331 = stablehlo.slice %321 [0:4, 0:2048, 0:8, 16:32] : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x16xbf16>
    %332 = stablehlo.multiply %330, %46 : tensor<4x2048x8x16xbf16>
    %333 = stablehlo.multiply %331, %48 : tensor<4x2048x8x16xbf16>
    %334 = stablehlo.add %332, %333 : tensor<4x2048x8x16xbf16>
    %335 = stablehlo.multiply %330, %52 : tensor<4x2048x8x16xbf16>
    %336 = stablehlo.multiply %331, %46 : tensor<4x2048x8x16xbf16>
    %337 = stablehlo.add %335, %336 : tensor<4x2048x8x16xbf16>
    %338 = stablehlo.concatenate %334, %337, dim = 3 : (tensor<4x2048x8x16xbf16>, tensor<4x2048x8x16xbf16>) -> tensor<4x2048x8x32xbf16>
    %339 = stablehlo.slice %325 [0:4, 0:2048, 0:4, 0:16] : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x16xbf16>
    %340 = stablehlo.slice %325 [0:4, 0:2048, 0:4, 16:32] : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x16xbf16>
    %341 = stablehlo.multiply %339, %59 : tensor<4x2048x4x16xbf16>
    %342 = stablehlo.multiply %340, %61 : tensor<4x2048x4x16xbf16>
    %343 = stablehlo.add %341, %342 : tensor<4x2048x4x16xbf16>
    %344 = stablehlo.multiply %339, %64 : tensor<4x2048x4x16xbf16>
    %345 = stablehlo.multiply %340, %59 : tensor<4x2048x4x16xbf16>
    %346 = stablehlo.add %344, %345 : tensor<4x2048x4x16xbf16>
    %347 = stablehlo.concatenate %343, %346, dim = 3 : (tensor<4x2048x4x16xbf16>, tensor<4x2048x4x16xbf16>) -> tensor<4x2048x4x32xbf16>
    %348 = stablehlo.convert %338 : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x32xf32>
    %349 = stablehlo.power %348, %70 : tensor<4x2048x8x32xf32>
    %350 = stablehlo.reduce(%349 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x2048x8x32xf32>, tensor<f32>) -> tensor<4x2048x8xf32>
    %351 = stablehlo.reshape %350 : (tensor<4x2048x8xf32>) -> tensor<4x2048x8x1xf32>
    %352 = stablehlo.divide %351, %76 : tensor<4x2048x8x1xf32>
    %353 = stablehlo.add %352, %78 : tensor<4x2048x8x1xf32>
    %354 = stablehlo.rsqrt %353 : tensor<4x2048x8x1xf32>
    %355 = stablehlo.convert %354 : (tensor<4x2048x8x1xf32>) -> tensor<4x2048x8x1xbf16>
    %356 = stablehlo.broadcast_in_dim %355, dims = [0, 1, 2, 3] : (tensor<4x2048x8x1xbf16>) -> tensor<4x2048x8x32xbf16>
    %357 = stablehlo.multiply %338, %356 : tensor<4x2048x8x32xbf16>
    %358 = stablehlo.convert %347 : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x32xf32>
    %359 = stablehlo.power %358, %85 : tensor<4x2048x4x32xf32>
    %360 = stablehlo.reduce(%359 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x2048x4x32xf32>, tensor<f32>) -> tensor<4x2048x4xf32>
    %361 = stablehlo.reshape %360 : (tensor<4x2048x4xf32>) -> tensor<4x2048x4x1xf32>
    %362 = stablehlo.divide %361, %89 : tensor<4x2048x4x1xf32>
    %363 = stablehlo.add %362, %91 : tensor<4x2048x4x1xf32>
    %364 = stablehlo.rsqrt %363 : tensor<4x2048x4x1xf32>
    %365 = stablehlo.convert %364 : (tensor<4x2048x4x1xf32>) -> tensor<4x2048x4x1xbf16>
    %366 = stablehlo.broadcast_in_dim %365, dims = [0, 1, 2, 3] : (tensor<4x2048x4x1xbf16>) -> tensor<4x2048x4x32xbf16>
    %367 = stablehlo.multiply %347, %366 : tensor<4x2048x4x32xbf16>
    %368 = stablehlo.transpose %357, dims = [0, 2, 1, 3] : (tensor<4x2048x8x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %369 = stablehlo.transpose %367, dims = [0, 2, 1, 3] : (tensor<4x2048x4x32xbf16>) -> tensor<4x4x2048x32xbf16>
    %370 = stablehlo.transpose %329, dims = [0, 2, 1, 3] : (tensor<4x2048x4x32xbf16>) -> tensor<4x4x2048x32xbf16>
    %371 = stablehlo.reshape %369 : (tensor<4x4x2048x32xbf16>) -> tensor<4x4x1x2048x32xbf16>
    %372 = stablehlo.broadcast_in_dim %371, dims = [0, 1, 2, 3, 4] : (tensor<4x4x1x2048x32xbf16>) -> tensor<4x4x2x2048x32xbf16>
    %373 = stablehlo.reshape %372 : (tensor<4x4x2x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %374 = stablehlo.reshape %370 : (tensor<4x4x2048x32xbf16>) -> tensor<4x4x1x2048x32xbf16>
    %375 = stablehlo.broadcast_in_dim %374, dims = [0, 1, 2, 3, 4] : (tensor<4x4x1x2048x32xbf16>) -> tensor<4x4x2x2048x32xbf16>
    %376 = stablehlo.reshape %375 : (tensor<4x4x2x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %377 = stablehlo.transpose %373, dims = [0, 1, 3, 2] : (tensor<4x8x2048x32xbf16>) -> tensor<4x8x32x2048xbf16>
    %378 = stablehlo.reshape %368 : (tensor<4x8x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %379 = stablehlo.reshape %377 : (tensor<4x8x32x2048xbf16>) -> tensor<32x32x2048xbf16>
    %380 = stablehlo.broadcast_in_dim %379, dims = [0, 1, 2] : (tensor<32x32x2048xbf16>) -> tensor<32x32x2048xbf16>
    %381 = stablehlo.dot_general %378, %380, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x2048x32xbf16>, tensor<32x32x2048xbf16>) -> tensor<32x2048x2048xbf16>
    %382 = stablehlo.reshape %381 : (tensor<32x2048x2048xbf16>) -> tensor<4x8x2048x2048xbf16>
    %383 = stablehlo.multiply %382, %114 : tensor<4x8x2048x2048xbf16>
    %384 = stablehlo.broadcast_in_dim %383, dims = [0, 1, 2, 3] : (tensor<4x8x2048x2048xbf16>) -> tensor<4x8x2048x2048xbf16>
    %385 = stablehlo.select %133, %134, %384 : tensor<4x8x2048x2048xi1>, tensor<4x8x2048x2048xbf16>
    %386 = stablehlo.convert %385 : (tensor<4x8x2048x2048xbf16>) -> tensor<4x8x2048x2048xf32>
    %387 = stablehlo.reduce(%386 init: %cst_11) applies stablehlo.maximum across dimensions = [3] : (tensor<4x8x2048x2048xf32>, tensor<f32>) -> tensor<4x8x2048xf32>
    %388 = stablehlo.reshape %387 : (tensor<4x8x2048xf32>) -> tensor<4x8x2048x1xf32>
    %389 = stablehlo.broadcast_in_dim %388, dims = [0, 1, 2, 3] : (tensor<4x8x2048x1xf32>) -> tensor<4x8x2048x2048xf32>
    %390 = stablehlo.subtract %386, %389 : tensor<4x8x2048x2048xf32>
    %391 = stablehlo.exponential %390 : tensor<4x8x2048x2048xf32>
    %392 = stablehlo.reduce(%391 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x8x2048x2048xf32>, tensor<f32>) -> tensor<4x8x2048xf32>
    %393 = stablehlo.reshape %392 : (tensor<4x8x2048xf32>) -> tensor<4x8x2048x1xf32>
    %394 = stablehlo.broadcast_in_dim %393, dims = [0, 1, 2, 3] : (tensor<4x8x2048x1xf32>) -> tensor<4x8x2048x2048xf32>
    %395 = stablehlo.divide %391, %394 : tensor<4x8x2048x2048xf32>
    %396 = stablehlo.convert %395 : (tensor<4x8x2048x2048xf32>) -> tensor<4x8x2048x2048xbf16>
    %397 = stablehlo.reshape %396 : (tensor<4x8x2048x2048xbf16>) -> tensor<32x2048x2048xbf16>
    %398 = stablehlo.reshape %376 : (tensor<4x8x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %399 = stablehlo.broadcast_in_dim %398, dims = [0, 1, 2] : (tensor<32x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %400 = stablehlo.dot_general %397, %399, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x2048x2048xbf16>, tensor<32x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %401 = stablehlo.reshape %400 : (tensor<32x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %402 = stablehlo.transpose %401, dims = [0, 2, 1, 3] : (tensor<4x8x2048x32xbf16>) -> tensor<4x2048x8x32xbf16>
    %403 = stablehlo.reshape %402 : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x256xbf16>
    %404 = stablehlo.transpose %arg16, dims = [1, 0] : (tensor<256x256xbf16>) -> tensor<256x256xbf16>
    %405 = stablehlo.reshape %403 : (tensor<4x2048x256xbf16>) -> tensor<8192x256xbf16>
    %406 = stablehlo.dot_general %405, %404, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x256xbf16>) -> tensor<8192x256xbf16>
    %407 = stablehlo.reshape %406 : (tensor<8192x256xbf16>) -> tensor<4x2048x256xbf16>
    %408 = stablehlo.add %306, %407 : tensor<4x2048x256xbf16>
    %409 = stablehlo.convert %408 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x256xf32>
    %410 = stablehlo.power %409, %5 : tensor<4x2048x256xf32>
    %411 = stablehlo.reduce(%410 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<4x2048x256xf32>, tensor<f32>) -> tensor<4x2048xf32>
    %412 = stablehlo.reshape %411 : (tensor<4x2048xf32>) -> tensor<4x2048x1xf32>
    %413 = stablehlo.divide %412, %11 : tensor<4x2048x1xf32>
    %414 = stablehlo.add %413, %15 : tensor<4x2048x1xf32>
    %415 = stablehlo.rsqrt %414 : tensor<4x2048x1xf32>
    %416 = stablehlo.convert %415 : (tensor<4x2048x1xf32>) -> tensor<4x2048x1xbf16>
    %417 = stablehlo.broadcast_in_dim %416, dims = [0, 1, 2] : (tensor<4x2048x1xbf16>) -> tensor<4x2048x256xbf16>
    %418 = stablehlo.multiply %408, %417 : tensor<4x2048x256xbf16>
    %419 = stablehlo.transpose %arg17, dims = [1, 0] : (tensor<1024x256xbf16>) -> tensor<256x1024xbf16>
    %420 = stablehlo.reshape %418 : (tensor<4x2048x256xbf16>) -> tensor<8192x256xbf16>
    %421 = stablehlo.dot_general %420, %419, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x1024xbf16>) -> tensor<8192x1024xbf16>
    %422 = stablehlo.reshape %421 : (tensor<8192x1024xbf16>) -> tensor<4x2048x1024xbf16>
    %423 = stablehlo.maximum %422, %cst_12 : tensor<4x2048x1024xbf16>
    %424 = stablehlo.power %423, %177 : tensor<4x2048x1024xbf16>
    %425 = stablehlo.transpose %arg18, dims = [1, 0] : (tensor<256x1024xbf16>) -> tensor<1024x256xbf16>
    %426 = stablehlo.reshape %424 : (tensor<4x2048x1024xbf16>) -> tensor<8192x1024xbf16>
    %427 = stablehlo.dot_general %426, %425, contracting_dims = [1] x [0] : (tensor<8192x1024xbf16>, tensor<1024x256xbf16>) -> tensor<8192x256xbf16>
    %428 = stablehlo.reshape %427 : (tensor<8192x256xbf16>) -> tensor<4x2048x256xbf16>
    %429 = stablehlo.add %408, %428 : tensor<4x2048x256xbf16>
    %430 = stablehlo.convert %429 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x256xf32>
    %431 = stablehlo.power %430, %5 : tensor<4x2048x256xf32>
    %432 = stablehlo.reduce(%431 init: %cst) applies stablehlo.add across dimensions = [2] : (tensor<4x2048x256xf32>, tensor<f32>) -> tensor<4x2048xf32>
    %433 = stablehlo.reshape %432 : (tensor<4x2048xf32>) -> tensor<4x2048x1xf32>
    %434 = stablehlo.divide %433, %11 : tensor<4x2048x1xf32>
    %435 = stablehlo.add %434, %15 : tensor<4x2048x1xf32>
    %436 = stablehlo.rsqrt %435 : tensor<4x2048x1xf32>
    %437 = stablehlo.convert %436 : (tensor<4x2048x1xf32>) -> tensor<4x2048x1xbf16>
    %438 = stablehlo.broadcast_in_dim %437, dims = [0, 1, 2] : (tensor<4x2048x1xbf16>) -> tensor<4x2048x256xbf16>
    %439 = stablehlo.multiply %429, %438 : tensor<4x2048x256xbf16>
    %440 = stablehlo.transpose %arg19, dims = [1, 0] : (tensor<256x256xbf16>) -> tensor<256x256xbf16>
    %441 = stablehlo.reshape %439 : (tensor<4x2048x256xbf16>) -> tensor<8192x256xbf16>
    %442 = stablehlo.dot_general %441, %440, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x256xbf16>) -> tensor<8192x256xbf16>
    %443 = stablehlo.reshape %442 : (tensor<8192x256xbf16>) -> tensor<4x2048x256xbf16>
    %444 = stablehlo.reshape %443 : (tensor<4x2048x256xbf16>) -> tensor<4x2048x8x32xbf16>
    %445 = stablehlo.transpose %arg20, dims = [1, 0] : (tensor<128x256xbf16>) -> tensor<256x128xbf16>
    %446 = stablehlo.dot_general %441, %445, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x128xbf16>) -> tensor<8192x128xbf16>
    %447 = stablehlo.reshape %446 : (tensor<8192x128xbf16>) -> tensor<4x2048x128xbf16>
    %448 = stablehlo.reshape %447 : (tensor<4x2048x128xbf16>) -> tensor<4x2048x4x32xbf16>
    %449 = stablehlo.transpose %arg21, dims = [1, 0] : (tensor<128x256xbf16>) -> tensor<256x128xbf16>
    %450 = stablehlo.dot_general %441, %449, contracting_dims = [1] x [0] : (tensor<8192x256xbf16>, tensor<256x128xbf16>) -> tensor<8192x128xbf16>
    %451 = stablehlo.reshape %450 : (tensor<8192x128xbf16>) -> tensor<4x2048x128xbf16>
    %452 = stablehlo.reshape %451 : (tensor<4x2048x128xbf16>) -> tensor<4x2048x4x32xbf16>
    %453 = stablehlo.slice %444 [0:4, 0:2048, 0:8, 0:16] : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x16xbf16>
    %454 = stablehlo.slice %444 [0:4, 0:2048, 0:8, 16:32] : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x16xbf16>
    %455 = stablehlo.multiply %453, %46 : tensor<4x2048x8x16xbf16>
    %456 = stablehlo.multiply %454, %48 : tensor<4x2048x8x16xbf16>
    %457 = stablehlo.add %455, %456 : tensor<4x2048x8x16xbf16>
    %458 = stablehlo.multiply %453, %52 : tensor<4x2048x8x16xbf16>
    %459 = stablehlo.multiply %454, %46 : tensor<4x2048x8x16xbf16>
    %460 = stablehlo.add %458, %459 : tensor<4x2048x8x16xbf16>
    %461 = stablehlo.concatenate %457, %460, dim = 3 : (tensor<4x2048x8x16xbf16>, tensor<4x2048x8x16xbf16>) -> tensor<4x2048x8x32xbf16>
    %462 = stablehlo.slice %448 [0:4, 0:2048, 0:4, 0:16] : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x16xbf16>
    %463 = stablehlo.slice %448 [0:4, 0:2048, 0:4, 16:32] : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x16xbf16>
    %464 = stablehlo.multiply %462, %59 : tensor<4x2048x4x16xbf16>
    %465 = stablehlo.multiply %463, %61 : tensor<4x2048x4x16xbf16>
    %466 = stablehlo.add %464, %465 : tensor<4x2048x4x16xbf16>
    %467 = stablehlo.multiply %462, %64 : tensor<4x2048x4x16xbf16>
    %468 = stablehlo.multiply %463, %59 : tensor<4x2048x4x16xbf16>
    %469 = stablehlo.add %467, %468 : tensor<4x2048x4x16xbf16>
    %470 = stablehlo.concatenate %466, %469, dim = 3 : (tensor<4x2048x4x16xbf16>, tensor<4x2048x4x16xbf16>) -> tensor<4x2048x4x32xbf16>
    %471 = stablehlo.convert %461 : (tensor<4x2048x8x32xbf16>) -> tensor<4x2048x8x32xf32>
    %472 = stablehlo.power %471, %70 : tensor<4x2048x8x32xf32>
    %473 = stablehlo.reduce(%472 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x2048x8x32xf32>, tensor<f32>) -> tensor<4x2048x8xf32>
    %474 = stablehlo.reshape %473 : (tensor<4x2048x8xf32>) -> tensor<4x2048x8x1xf32>
    %475 = stablehlo.divide %474, %76 : tensor<4x2048x8x1xf32>
    %476 = stablehlo.add %475, %78 : tensor<4x2048x8x1xf32>
    %477 = stablehlo.rsqrt %476 : tensor<4x2048x8x1xf32>
    %478 = stablehlo.convert %477 : (tensor<4x2048x8x1xf32>) -> tensor<4x2048x8x1xbf16>
    %479 = stablehlo.broadcast_in_dim %478, dims = [0, 1, 2, 3] : (tensor<4x2048x8x1xbf16>) -> tensor<4x2048x8x32xbf16>
    %480 = stablehlo.multiply %461, %479 : tensor<4x2048x8x32xbf16>
    %481 = stablehlo.convert %470 : (tensor<4x2048x4x32xbf16>) -> tensor<4x2048x4x32xf32>
    %482 = stablehlo.power %481, %85 : tensor<4x2048x4x32xf32>
    %483 = stablehlo.reduce(%482 init: %cst) applies stablehlo.add across dimensions = [3] : (tensor<4x2048x4x32xf32>, tensor<f32>) -> tensor<4x2048x4xf32>
    %484 = stablehlo.reshape %483 : (tensor<4x2048x4xf32>) -> tensor<4x2048x4x1xf32>
    %485 = stablehlo.divide %484, %89 : tensor<4x2048x4x1xf32>
    %486 = stablehlo.add %485, %91 : tensor<4x2048x4x1xf32>
    %487 = stablehlo.rsqrt %486 : tensor<4x2048x4x1xf32>
    %488 = stablehlo.convert %487 : (tensor<4x2048x4x1xf32>) -> tensor<4x2048x4x1xbf16>
    %489 = stablehlo.broadcast_in_dim %488, dims = [0, 1, 2, 3] : (tensor<4x2048x4x1xbf16>) -> tensor<4x2048x4x32xbf16>
    %490 = stablehlo.multiply %470, %489 : tensor<4x2048x4x32xbf16>
    %491 = stablehlo.transpose %480, dims = [0, 2, 1, 3] : (tensor<4x2048x8x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %492 = stablehlo.transpose %490, dims = [0, 2, 1, 3] : (tensor<4x2048x4x32xbf16>) -> tensor<4x4x2048x32xbf16>
    %493 = stablehlo.transpose %452, dims = [0, 2, 1, 3] : (tensor<4x2048x4x32xbf16>) -> tensor<4x4x2048x32xbf16>
    %494 = stablehlo.reshape %492 : (tensor<4x4x2048x32xbf16>) -> tensor<4x4x1x2048x32xbf16>
    %495 = stablehlo.broadcast_in_dim %494, dims = [0, 1, 2, 3, 4] : (tensor<4x4x1x2048x32xbf16>) -> tensor<4x4x2x2048x32xbf16>
    %496 = stablehlo.reshape %495 : (tensor<4x4x2x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %497 = stablehlo.reshape %493 : (tensor<4x4x2048x32xbf16>) -> tensor<4x4x1x2048x32xbf16>
    %498 = stablehlo.broadcast_in_dim %497, dims = [0, 1, 2, 3, 4] : (tensor<4x4x1x2048x32xbf16>) -> tensor<4x4x2x2048x32xbf16>
    %499 = stablehlo.reshape %498 : (tensor<4x4x2x2048x32xbf16>) -> tensor<4x8x2048x32xbf16>
    %500 = stablehlo.transpose %496, dims = [0, 1, 3, 2] : (tensor<4x8x2048x32xbf16>) -> tensor<4x8x32x2048xbf16>
    %501 = stablehlo.reshape %491 : (tensor<4x8x2048x32xbf16>) -> tensor<32x2048x32xbf16>
    %502 = stablehlo.reshape %500 : (tensor<4x8x32x2048xbf16>) -> tensor<32x32x2048xbf16>
    %503 = stablehlo.broadcast_in_dim %502, dims = [0, 1, 2] : (tensor<32x32x2048xbf16>) -> tensor<32x32x2048xbf16>
    %504 = stablehlo.dot_general %501, %503, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x2048x32xbf16>, tensor<32x32x2048xbf16>) -> tensor<32x2048x2048xbf16>
    %505 = stablehlo.reshape %504 : (tensor<32x2048x2048xbf16>) -> tensor<4x8x2048x2048xbf16>
    %506 = stablehlo.multiply %505, %114 : tensor<4x8x2048x2048xbf16>
    %507 = stablehlo.broadcast_in_dim %506, dims = [0, 1, 2, 3] : (tensor<4x8x2048x2048xbf16>) -> tensor<4x8x2048x2048xbf16>
    %508 = stablehlo.select %133, %134, %507 : tensor<4x8x2048x2048xi1>, tensor<4x8x2048x2048xbf16>
    %509 = stablehlo.convert %508 : (tensor<4x8x2048x2048xbf16>) -> tensor<4x8x2048x2048xf32>
    %510 = stablehlo.reduce(%509 init: %cst_11) applies stablehlo.maximum across dimensions = [3] : (tensor<4x8x2048x2048xf32>, tensor<f32>) -> tensor<4x8x2048xf32>
    %511 = stablehlo.reshape %510 : (tensor<4x8x2048xf32>) -> tensor<4x8x2048x1xf32>
